package ir.maziardev.chatrapp.activitys;


import android.annotation.TargetApi;
import android.content.Context;
import android.content.Intent;
import android.os.Build;
import android.os.Bundle;
import android.util.Log;
import android.view.MenuItem;
import android.view.View;
import android.view.animation.Animation;
import android.view.animation.AnimationUtils;
import android.widget.ImageView;
import android.widget.TextView;
import android.widget.Toast;

import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;
import androidx.cardview.widget.CardView;
import androidx.core.widget.NestedScrollView;
import androidx.recyclerview.widget.DefaultItemAnimator;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.bumptech.glide.Glide;
import com.google.android.material.appbar.AppBarLayout;
import com.google.android.material.floatingactionbutton.FloatingActionButton;

import java.util.ArrayList;
import java.util.List;

import butterknife.BindView;
import butterknife.ButterKnife;
import ir.maziardev.chatrapp.R;
import ir.maziardev.chatrapp.adapter.GridListAdapter;
import ir.maziardev.chatrapp.enums.DetailType;
import ir.maziardev.chatrapp.enums.Extras;
import ir.maziardev.chatrapp.models.GridList;
import uk.co.chrisjenx.calligraphy.CalligraphyContextWrapper;

public class DetailActivity extends AppCompatActivity {

    @BindView(R.id.justifiedtext)
    TextView txt_detail;
    @BindView(R.id.expandedImage)
    ImageView expandedImage;
    @BindView(R.id.card_detail_content)
    CardView cardDetail;
    @BindView(R.id.recycler_detail)
    RecyclerView recyclerView;
    @BindView(R.id.nested_scroll)
    NestedScrollView nested_scroll;

    GridListAdapter mAdapter;
    //private PageType pageType;
    private List<GridList> gridList = new ArrayList<>();

    String share_title;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_detail);
        ButterKnife.bind(this);

        recyclerView.setVisibility(View.GONE);

        Bundle ex = getIntent().getExtras();
        if (ex != null) {
            Glide.with(this).load(ex.getString(Extras.EXTRA_URL.toString())).into(expandedImage);
            share_title = ex.getString(Extras.EXTRA_TITLE.toString());
            if(ex.getString(Extras.EXTRA_OP.toString()).equals("s")){
                switch ((DetailType)ex.get(Extras.EXTRA_DESCRIPTION.toString())){
                    case ZENDGINAMERAHBARI:
                        data1();
                        break;
                    case VELAYATFAGHIH:
                        data2();
                        break;
                    case BAYANIE:
                        data3();
                        break;
                    case SABKZENDGI:
                        data4();
                        break;
                    case MAASH:
                        data5();
                        break;

                }
            }else {
                if(ex.getString(Extras.EXTRA_ACTION.toString()).equals("1")){
                    txt_detail.setText(ex.getString(Extras.EXTRA_DESCRIPTION.toString()));

                }else if(ex.getString(Extras.EXTRA_ACTION.toString()).equals("2")){
                    Intent intent = new Intent(DetailActivity.this, WebActivity.class);
                    intent.putExtra(Extras.EXTRA_URL.toString(), ex.getString(Extras.EXTRA_DESCRIPTION.toString()));
                    intent.putExtra(Extras.EXTRA_PAGE_MASTER.toString(), "1");
                    startActivity(intent);
                    finish();

                }else if(ex.getString(Extras.EXTRA_ACTION.toString()).equals("3")){
                    //txt_detail.setText(ex.getString(AppController.EXTRA_DESCRIPTION));
                    cardDetail.setVisibility(View.GONE);
                    recyclerView.setVisibility(View.VISIBLE);

                    mAdapter = new GridListAdapter(this, gridList);
                    GridLayoutManager gridVertical = new GridLayoutManager(this, 2, GridLayoutManager.VERTICAL, false);
                    RecyclerView.LayoutManager mLayoutManager = gridVertical;
                    //RecyclerView.LayoutManager mLayoutManager = new LinearLayoutManager(getApplicationContext());
                    recyclerView.setLayoutManager(mLayoutManager);
                    recyclerView.setItemAnimator(new DefaultItemAnimator());
                    recyclerView.setAdapter(mAdapter);

                    nested_scroll.setVisibility(View.GONE);



                    String[] all = ex.getString(Extras.EXTRA_DESCRIPTION.toString()).split("!");
                    for (int i = 0; i < all.length; i++) {
                        GridList gridList = new GridList();
                        gridList.setTitle("  صفحه"+(i+1));
                        gridList.setImg(all[i]);

                        gridList.setSeries(false);
                        //Log.e("TAG-----------",all[i]);

                        this.gridList.add(gridList);
                    }
                    mAdapter.notifyDataSetChanged();

                }else if(ex.getString(Extras.EXTRA_ACTION.toString()).equals("4")){

                    Intent intent = new Intent(DetailActivity.this, VideoActivity.class);
                    intent.putExtra(Extras.EXTRA_URL.toString(), ex.getString(Extras.EXTRA_DESCRIPTION.toString()));
                    intent.putExtra(Extras.EXTRA_TITLE.toString(), "پخش زنده");
                    intent.putExtra(Extras.PORTRATE.toString(), "1");
                    startActivity(intent);
                    finish();

                }else if(ex.getString(Extras.EXTRA_ACTION.toString()).equals("5")){
                    //txt_detail.setText(ex.getString(AppController.EXTRA_DESCRIPTION));
                    cardDetail.setVisibility(View.GONE);
                    recyclerView.setVisibility(View.VISIBLE);

                    mAdapter = new GridListAdapter(this, gridList);
                    GridLayoutManager gridVertical = new GridLayoutManager(this, 2, GridLayoutManager.VERTICAL, false);
                    RecyclerView.LayoutManager mLayoutManager = gridVertical;
                    //RecyclerView.LayoutManager mLayoutManager = new LinearLayoutManager(getApplicationContext());
                    recyclerView.setLayoutManager(mLayoutManager);
                    recyclerView.setItemAnimator(new DefaultItemAnimator());
                    recyclerView.setAdapter(mAdapter);

                    nested_scroll.setVisibility(View.GONE);

                    String[] names = ex.getString(Extras.EXTRA_DETAIL.toString()).split("!");
                    String[] all = ex.getString(Extras.EXTRA_DESCRIPTION.toString()).split("!");
                    for (int i = 0; i < all.length; i++) {
                        GridList gridList = new GridList();
                        gridList.setTitle(names[i]);
                        gridList.setImg(all[i]);

                        gridList.setSeries(false);
                        this.gridList.add(gridList);
                    }
                    mAdapter.notifyDataSetChanged();

                }

            }

        }

        FloatingActionButton fab = findViewById(R.id.fab);
        fab.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                Intent sendIntent = new Intent();
                sendIntent.setAction(Intent.ACTION_SEND);
                sendIntent.putExtra(Intent.EXTRA_TEXT,
                        share_title + " \n" + txt_detail.getText());
                sendIntent.setType("text/plain");
                startActivity(Intent.createChooser(sendIntent, "اشتراک گذاری در..."));
            }
        });



    }

    private void data5() {
        txt_detail.setText("" +
                "سلام دوستان عزیز:" +
                "\n" +
                "این بخش در راستای حمایت از خانواده ها" +
                "..." +
                "" +
                "" +
                "");
    }

    private void data4() {
        txt_detail.setText("" +
                "\n" +
                "سبک زندگی اسلامی، ضرورت\u200Cها و راهبردها\n" +
                "چکیده\n" +
                "سبک زندگی عبارت است از مجموعه رفتارها و الگوهای کنش فردی و گروهی که معطوف به ابعاد هنجاری و معنایی زندگی اجتماعی باشد. با توجه به ویژگی انتخاب گری که در سبک زندگی وجود دارد، می توان هر مجموعه منسجمی از الگوهای رفتاری برآمده از آموزه های دینی را که در چارچوب معین شده از طرف دین قرار داشته باشد، یک سبک زندگی دینی به شمار آورد. برای تعریف، ترسیم و ترویج سبک زندگی دینی لازم است که با تکیه بر منابع معرفتی اسلام به بازخوانی فرهنگ دینی خود پرداخته و به جایگاه مقدمی سبک زندگی در فرآیند شکل گیری تمدن نوین اسلامی توجه ویژه داشته باشیم. برای نیل به این مقصود نیز اندیشمندان و دانش آموختگان حوزه های علمیه باید با نگاهی آینده نگر و با تمام توان خود وارد میدان شده و مباحث سبک زندگی را پیگیری کنند.\n" +
                "\n" +
                "کلید واژه: سبک زندگی، تمدن اسلامی، الگوهای رفتار، آموزه های اسلامی، آینده نگری.\n" +
                "\n" +
                "مقدمه\n" +
                "سبک زندگی به عنوان مجموعه در هم تنیده ای از الگوهای رفتاری فردی و اجتماعی، برآمده از نظام معنایی متمایزی است که یک فرهنگ در یک جامعه انسانی ایجاد می کند؛ و از آن جایی که هیچ کدام از جوامع بشری را نمی توان عاری از فرهنگ تصور کرد، بنابراین، می توان گفت تمام اجتماعات انسانی، از ابتدای تاریخ تا کنون دارای سبک زندگی خاص خود بوده و از الگوهای رفتاری متناسب با شاخص های فرهنگی خود برخوردار بوده اند. بر اساس چنین رویکردی، بحث از سبک زندگی و الگوهای نظام مند رفتاری، بحث تازه ای نخواهد بود؛ پس چرا اکنون سبک زندگی تا این حد اهمیت یافته و توجه بسیاری را به خود جلب کرده است؟ واقعیت آن است که اقتضائات زندگی در جوامع مدرن و متکی بر فرهنگ و تمدن غربی، به تدریج الگوهای خاصی را برای زندگی و رفتار ارائه کرده است. به زعم دانشمندان علوم اجتماعی در یک قرن گذشته، شرایط جدید کار، تولید، انباشتگی کالاهای مصرفی و همچنین فراهم آمدن زمان فراغت بیشتر برای بخش زیادی از اقشار جامعه، نشانه ای از تحول عمیق اجتماعی و فرهنگی بوده و این شرایط نوین، الگوهای رفتاری تازه ای را می طلبد که می توان آن ها را در قالب عنوان کلی سبک زندگی۱ مورد بررسی قرار داد. حاصل این رویکرد نیز خواسته یا ناخواسته، تلاشی گسترده برای معرفی، ترویج و تثبیت سبک خاصی از زندگی خواهد بود که خاستگاه آن، فرهنگ سکولار غربی و عقبه معرفتی آن است.\n" +
                "روشن است که پذیرش منفعلانه این گونه از الگوهای رفتاری، برای جوامع مسلمان که خود در پرتو آموزه های اسلامی، توانایی تعریف و ترسیم سبک زندگی دینی و تبیین الگوهای متناسب با آن را دارند، شایسته نبوده و باید به اقتضای فرهنگ دینی خود، به سبک زندگی اسلامی روی آورند. به ویژه آن که در چند دهه اخیر، ناکارآمدی تمدن سکولار غربی در پاسخ گویی به نیازهای چندبعدی انسان آشکار گردیده و رصد تحولات جاری در جهان نیز نشانه های افول و فرود این تمدن را نمایان ساخته است. تجربه تاریخی بشر نیز نشان داده که وقتی یک تمدن به پایان راه خود می رسد، زمینه مناسبی برای شکوفایی تمدن های دیگر فراهم می شود و جامعه بشری که معمولاً در برابر تغییر و تحول ژرف اجتماعی مقاوم است، در چنین وضعیتی با رضایت خاطر از دگرگونی و جایگزینی استقبال می کند. در پرتو چنین فرصتی می توان با تکیه بر غنا و تعالی آموزه های اصیل اسلامی، این جایگزین را که همچون گنجینه ای پربها و برگرفته از میراث آسمانی اسلام نزد ما مسلمانان نهفته است، هم خود بهتر بشناسیم و هم به جهانیان معرفی کنیم.\n" +
                "بازخوانی آموزه های اسلام و ژرف اندیشی در آن، ظرفیت بالای این آموزه ها را برای فرهنگ سازی و ارائه الگوهای رفتاری مناسب نشان می دهد؛ زیرا انتزاعی ترین لایه های اعتقادی و معرفتی تا عینی ترین سطوح رفتاری که امروزه با عنوان سبک زندگی از آن یاد می شود، در چارچوب نظام معنایی اسلام جای گرفته و در مسیر تکامل و سعادت انسان مورد استفاده قرار می گیرد. در این راستا، قرآن که مهم ترین منبع آموزه های اسلامی به شمار می رود، سرشار از الگوهایی است که شیوه زیست مؤمنانه و مورد نظر اسلام را معرفی می کند؛ و در پرتو آیات آن، سیره پیامبر گرامی اسلام(نیز) به عنوان اسوه و نمونه عالی زندگی به تمام مسلمانان معرفی شده است. همچنین روایات و حکایات فراوانی از اهل بیت(در) اختیار جامعه مسلمان قرار دارد که با الهام از تعالیم نورانی قرآن کریم و در شرایط متفاوت اجتماعی، مصادیق متعددی از الگوهای زندگی دینی را تبیین و معرفی کرده اند. خصوصاً بهره مندی برخی از این دوره های تاریخی از تمایزات ویژه فرهنگی، اجتماعی، سیاسی و علمی، برای زمان ما که جامعه اسلامی بار دیگر در دوره گذار قرار گرفته، می تواند دستاوردهای بسیار مهمی را در پی داشته باشد.\n" +
                "\n" +
                "سبک زندگی دینی\n" +
                "سبک زندگی در حوزه مطالعات فرهنگی به مجموعه رفتارها و الگوهای کنش هر فرد که معطوف به ابعاد هنجاری و معنایی زندگی اجتماعی باشد، اطلاق می شود. طبیعی است که بر اساس چنین رویکردی، سبک زندگی علاوه بر این که دلالت بر ماهیت و محتوای خاص تعاملات و کنش های اشخاص در هر جامعه دارد و مبین اغراض، نیات، معانی و تفاسیر فرد در جریان عمل روزمره است، نشان دهنده کم و کیف نظام باورها و ارزش های افراد نیز خواهد بود(فاضل قانع، ۱۳۹۲: ۹). چنین برداشتی از مفهوم سبک زندگی، علاوه بر این که پشتیبانی جدیدترین دیدگاه های مطرح در این عرصه را به همراه دارد(بوردیو، ۱۳۹۰: ۲۸۶ و ۳۳۷؛ گیدنز، ۱۳۸۷: ۱۲۰)، از قابلیت خوبی برای بومی سازی مفهوم سبک زندگی بر اساس اقتضائات جامعه اسلامی برخوردار است.\n" +
                "تمرکز اندیشمندان بر شاخص هایی مانند الگوی مصرف، شیوه گذران اوقات فراغت، الگوهای تمرکز بر علاقمندی ها، آداب معاشرت، الگوهای زندگی خانوادگی و بهداشت و سلامت، نشان می دهد که مطالعات سبک زندگی حول یک محور عمومی با عنوان کلی «سلیقه»۲ دور می زند(مهدوی کنی، ۱۳۸۶: ۲۱۶). سلیقه، یک امر ذهنی است که در قالب تمایلات و ترجیحات رفتاری انسان جلوه گر شده و بدین ترتیب، فرهنگ و اجزای آن که امری کلی و عمومی به شمار می آید، در پرتو این تمایلات و ترجیحات برآمده از سلیقه، فردیت پیدا کرده و هویت فرد را برای دیگران ترسیم می کند(بوردیو، ۱۳۹۰: ۹۳). بدین ترتیب می توان فرهنگ یا خرده فرهنگ را خاستگاه سبک زندگی دانست(فاضل قانع، ۱۳۹۱: ۱۸۰)؛ اما روشن است که خود فرهنگ نیز متأثر از عوامل متعددی است که یکی از مهم ترین این عوامل، دین و آموزه های وحیانی است.\n" +
                "آموزه های دین به عنوان ابزار جامع هدایت و راهبری بشر، در بسیاری از موارد، حاکم بر باورها، ارزش ها و هنجارهای لازم برای جهت دهی و الگوبخشی به رفتار و کنش انسانی است. در واقع، محدود نکردن دین به فهم زمانی خاص، اعتقاد به تکامل فرهنگی و سهیم بودن اراده انسان ها در آن و تبیین درست ارتباط میان فرهنگِ متغیر و دینِ ثابت، ما را به این دیدگاه رهنمون می شود که دین و آموزه های وحیانی آن می تواند بخش مهمی از خاستگاه فرهنگ بشری را تشکیل دهد. پس در یک رابطه طولی، دین، فرهنگ جامعه را شکل می دهد؛ و فرهنگ نیز به نوبه خود، نظام و ساختار خاصی را برای زندگی فردی و اجتماعی تعریف می کند؛ که خود به عنوان سرچشمه و خاستگاه مجموعه در هم تنیده ای از الگوهای خاص برای زندگی، یک کل منسجم و متمایز را در قالب سبک زندگی پدید می آورد؛ و البته سبک زندگی نیز به توسعه و نفوذ نظام معرفتی مبتنی بر آموزه های دینی یاری رسانده و تمایلات و ترجیحات برآمده از فرهنگ دینی را بارور می سازد.\n" +
                "بر خلاف رویکرد کلاسیک جامعه شناسان که به توصیف سبک زندگی جاری افراد و گروه های اجتماعی بسنده می کنند ،۳ با الهام از روش های برگرفته از آموزه های دینی می توان گامی فراتر از توصیف نهاده و با تکیه بر اصول ثابتی که به اعتقاد ما در آموزه های اسلامی موجود است، چارچوبی ارائه نمود که در محدوده آن، به تجویز نیز بپردازیم؛ یعنی با دخالت دادن مجموعه ای از باورها و ارزش ها، به ترسیم و شکل گیری سبک خاص زندگی کمک نماییم. این رویکرد دقیقاً همان شیوه ای است که از سوی پیامبران الهی پی گیری شده است؛ آنان از ابزار حاکم ساختن باورها و ارزش های دینی برای ایجاد دگرگونی در سلیقه و شیوه انتخاب مردم، بهره می گرفتند تا آن ها با رضایت خاطر به اصلاح الگوهای سبک زندگی خود اقدام نمایند.\n" +
                "اما این که آموزه های اسلامی را به عنوان معیار در نظر می گیریم و درصدد تجویز مفاهیم و شاخص های برگرفته از آن بر می آییم، مبتنی بر این پیش فرض اساسی است که جامعیت دین اسلام، همه ابعاد و زوایای زندگی انسان را در بر گرفته و او را همواره در انتخاب مسیر درست زندگی یاری می کند. همین جامعیت باعث می گردد تا سبک زندگی دینی را لزوماً منحصر در یک نظام الگویی و رفتاری واحد ندانسته و در محدوده و چارچوب برآمده از اصول اسلامی، سبک های متعددی را بپذیریم. سیره عملی پیامبر اسلام(صلی الله علیه و آله و سلم) و اهل بیت(علیهم السلام) در مواجهه با اصحاب خود نیز نشان می دهد که ایشان، اختلاف سبک را می پذیرفتند .۴ پس ارزش ها و نگرش های همسان، لزوماً به سبک زندگی یکسان نمی انجامد؛ و با توجه به ویژگی انتخاب گری که در سبک زندگی وجود دارد، می توان هر مجموعه منسجمی از الگوهای رفتاری برآمده از آموزه های دینی را که در چارچوب معین شده از طرف دین قرار داشته باشد، یک سبک زندگی دینی به شمار آورد. مهم آن است که در فرآیند تعامل تمایلات و منابع،۵ از این چارچوب خارج نشویم که البته در این زمینه، توجه به گروه های مرجع بسیار کارگشا خواهد بود.۶ گروه های مرجع دارای دو کارکرد اصلی هستند: اول آن که هنجارها، رویه ها، ارزش ها و باورهایی را به دیگران القا می کنند؛ و دوم آن که معیارهایی را در اختیار کنش گران قرار می دهند تا کنش و نگرش خود را بر اساس آن محک بزنند(صدیق سروستانی و هاشمی، ۱۳۸۱: ۱۵۰). با توجه به این نقش بی بدیل، در فرهنگ اسلامی و به ویژه در آموزه های قرآنی به افراد و گروه های خاصی به عنوان الگوی زندگی اشاره گردیده که در رأس آن ها پیامبر اسلام به عنوان برترین اسوه معرفی شده است(احزاب/۲۱).\n" +
                "\n" +
                "ضرورت های تحقق سبک زندگی دینی\n" +
                "از آنچه در توضیح سبک زندگی دینی بیان شد، می توان ضرورت هایی را برای تحقق این سبک از زندگی استنتاج نمود:\n" +
                "\n" +
                "الف) بر خلاف ادعاهایی که در تفسیر و تبیین علم، توسط اندیشمندان رشد یافته در عصر مدرنیته و پست مدرنیسم مطرح شده است، دانش نمی تواند مستقل از زمینه های فرهنگی و عقبه معرفتی پدیدآورندگان آن باشد. در نتیجه، آن گونه از سبک زندگی که جامعه شناسان و روان شناسان غربی بر اساس اقتضائات فرهنگی و اجتماعی خود مورد توجه قرار داده و خواسته یا ناخواسته به ترویج آن می پردازند، آمیخته با نظام معنایی و معرفتی جوامع سکولار غربی بوده و لوازم و پیامدهای اجتماعی و تمدنی ویژه آنان را به همراه دارد. پس جوامع مسلمان نباید به شناسه های ظاهری و ادعایی که علم مدرن از خود ارائه می کند اعتماد کنند و آن را میراث مشترک بشریت که به فرهنگ و قوم خاص تعلق ندارد تلقی نمایند؛ زیرا با پذیرش چنین پنداری، حتی اگر بخواهیم در چارچوب ارائه شده از سوی آنان، دغدغه های دینی خود را نیز پوشش دهیم باز به نتیجه مطلوب نخواهیم رسید و به جای بازخوانی دین اسلام و فرهنگ مسلمانی، در ورطه بازسازی دین و فرهنگ و تغییرات ساختارشکنانه گرفتار خواهیم شد و جامعه مسلمان «به جای آن که نیازهای عصر و محیط خود را با روش اجتهادی، از طریق بنیان ها و اصول خود پاسخ دهد و در جهت دینی کردن عصر خود گام بردارد، ذخیره های فرهنگی امت اسلامی را در خدمت عرف دنیوی بشر امروز قرار می دهد.»(پارسانیا، ۱۳۹۰: ۳۵) پس یکی از ضرورت های تحقق سبک زندگی اسلامی آن است که فراتر از پارادایم غالب و حاکم بر اندیشه سکولار، به بازخوانی فرهنگ مسلمانی و آموزه های اسلامی خود بپردازیم و با تکیه بر منابع معرفتی اسلام، سبک زندگی متناسب با فرهنگ دینی و سازگار با اقتضائات عصری را تعریف، ترسیم و ترویج نماییم.\n" +
                "\n" +
                "ب) سبک زندگی و مجموعه الگوهای رفتاری آن، اگر از تناسب فرهنگی برخوردار بوده و کارکردهای شایسته و مورد انتظار را به همراه داشته باشد، می تواند در پدید آمدن یک تمدن بزرگ انسانی، اثرگذار باشد. فرهنگ به عنوان مجموعه در هم تنیده و رو به تکاملی از ویژگی های خاص زندگی اجتماعی انسان، هم شامل ارزش های مورد توجه اعضای یک جامعه یا گروه معین و هنجارهایی که از آن پیروی می کنند، می شود و هم کالاهای مادی که اعضای جامعه تولید می کنند و نیز چگونگی بهره برداری از آن ها را در بر می گیرد؛ به عبارت دیگر، علاوه بر هنر، ادبیات، موسیقی و نقاشی که فرآورده های متعالی ذهن به شمار می روند، چگونگی لباس پوشیدن اعضای جامعه، مراسم ازدواج، زندگی خانوادگی، الگوهای کار و فعالیت، مراسم مذهبی، انواع سرگرمی، شیوه گذران اوقات فراغت و مواردی از این دست را نیز می توان جزء فرهنگ دانست(گیدنز، ۱۳۸۱: ۵۶). بر این اساس می توان گفت فرهنگ با سبک زندگی دارای هم پوشانی بوده و در واقع، سبک زندگی بخشی از فرهنگ را تشکیل می دهد. برای توضیح بیشتر می توان گفت خاستگاه فرهنگ غالب در یک جامعه، ریشه در جهت گیری عمومی اعضای آن جامعه دارد؛ و این انتخاب و جهت گیری همگانی مبتنی بر ارتکازات جامعه و هنجارهای شکل یافته آن است. حس کمال جویی انسان و پیدایش نیازهای جدید که معلول شرایط متغیر فرهنگی، اقتصادی و سیاسی در جامعه می باشد، ضرورت حرکت تکاملی جامعه و ارتقای علمی و فکری آن را ایجاب می کند. بر اساس چنین رویکردی، ارزش ها، آرمان ها و باورهای مطلوب، ثابت هستند؛ اما ارزش ها و باورهای محقَق، دارای سلسله مراتب بوده و دست خوش تغییر و دگرگونی می شوند که به دنبال آن، روش ها، ابزارها و محصولات فرهنگی دائماً در حال بازتولید خواهد بود(پیروزمند، ۱۳۸۹: ۴۲)؛ این بازتولید ابزارها و روش ها، فرآیندی است که بر اساس اقتضائات زمانی و مکانی و فرهنگی صورت می گیرد و سبک زندگی را پدید می آورد. بدین ترتیب، روشن می شود که سبک زندگی، بخش متغیر و جاری فرهنگ است که همواره در چارچوب بخش ثابت فرهنگ، یعنی ارزش ها، آرمان ها و باورهای نهادینه شده در جامعه، پدید می آید.\n" +
                "از سوی دیگر، تمدن نیز بدون فرهنگ و جدای از آن قابل تصور نیست. زمانی که فرهنگ یک جامعه، متراکم گردیده و تجربه های مادی و معنوی آن جامعه به سطحی خاص و قابل قبول دست می یابد، در ابعاد گوناگون خود به نوعی از ظهور و بروز می رسد که می توان این جلوه و نمود عینی و خارجی را تمدن نامید. پس فرهنگ به منزله روح و چارچوبی است که زمینه ایجاد تمدن را فراهم می سازد. بر این اساس، می توان ادعا کرد که فرهنگ جوهر اصلی تمدن را تشکیل می دهد و تمدن جلوه مادی و معنوی فرهنگ به شمار می رود؛ یعنی فرهنگ با اثرگذاری در ساخته ها واندوخته های مادی و معنوی جامعه انسانی، در قالب تمدن جلوه گر می شود. زمانی که اعضای یک جامعه انسانی قدم در راه رشد و تعالی فرهنگ می نهند، پاسخ گویی به نیازها در هر دو بعد جسمانی و روحانی مورد توجه ایشان قرار می گیرد و تلاش می کنند که احتیاجات خود را در هر دو عرصه با جدیت برآورده سازند. حاصل این تلاش جمعی و همه جانبه در طی چندین نسل، تراکم دستاوردها و اندوخته های مادی و معنوی در قالب فرهنگ و سپس توسعه آن در قالب تمدن می باشد. پس اختراع ابزار و امکانات و شناسایی قوانین حاکم بر طبیعت از طریق کسب و انباشت علوم و دانش های گوناگون، تنها بخشی از آن را تشکیل می دهد؛ اما تمدن یک امر خنثی و بی طرف به شمار نمی آید و در این مقام، هر تمدنی بر اساس عقبه تئوریک و معرفتی که از آن برخاسته، دارای رویکرد و ماهیت خاصی خواهد بود و اگر فرهنگ به عنوان خاستگاه تمدن، خود برآمده از آموزه های دینی باشد، ماهیت تمدنِ برخاسته از آن نیز واجد این خصیصه خواهد بود. آموزه های دینی از راه ارتقا و بهبود اندوخته های مادی و معنوی بشر و خصوصاً جهت دهی ویژه به این اندوخته ها، در ایجاد تمدن نیز اثرگذار است.\n" +
                "از آن چه تا کنون پیرامون سبک زندگی و تمدن بیان شد، روشن می گردد که سبک زندگی و الگوهای آن جلوه و نمودی از بعد نرم افزاری فرهنگ به شمار می آید؛ اما تمدن، کلیت فرهنگ و از جمله سبک زندگی را به نمایش می گذارد. اگر سبک زندگی را به عنوان بخشی از فرهنگ در جهت گیری رفتاری افراد که از آن با عناوینی مانند سلیقه یا ترجیحات فردی و گروهی یاد می شود، تعیین کننده و مؤثر بدانیم، روشن است که این جهت دهی هم می تواند نیازهای انسان را تعریف و اولویت بندی کند؛ و هم می تواند شیوه تأمین این نیازها و راه برآوردن خواسته های انسانی را نشان دهد؛ و هم تناسب ابزارها و امکانات لازم برای تأمین نیازهای آدمی را با نظام معنایی و ارزش های فرهنگی موجود تعیین کند؛ و از آن جایی که جلوه خارجی این موارد در قالب تمدن نمودار می شود، می توان گفت که سبک زندگی، اثرات بنیادین و عمیقی بر شیوه شکل گیری تمدن و همچنین ارتقا و گسترش آن خواهد داشت. پس اگر به دنبال احیای تمدن اسلامی، یا پدید آوردن تمدن نوین اسلامی هستیم یکی از اقدامات اولیه و ضروری، توجه ویژه به سبک زندگی اسلامی و الگوهای رفتاری متناسب با آن خواهد بود.\n" +
                "\n" +
                "راهبردهای تحقق سبک زندگی دینی\n" +
                "ورود به فرآیند تعریف، ترسیم و ترویج سبک زندگی اسلامی نیازمند اتخاذ استراتژی و راهبردهای کلانی است که باید با دقت مورد توجه قرار گرفته و به درستی انتخاب شوند تا در میانه راه مجبور به عقب گرد نشویم:\n" +
                "\n" +
                "الف) بازخوانی آموزه های اصیل اسلامی برای استنتاج الگوهای رفتاری متناسب با اقتضائات اجتماعی معاصر، نیازمند ورود حوزه های علمیه و دانش آموختگان آن و ایفای نقشی برجسته و پررنگ از سوی آنان می باشد. تعریف و تبیین دقیق شاخص های تمدن و جامعه مطلوب اسلامی و سبک زندگی زمینه ساز آن، تنها از عهده دین شناسانی بر می آید که بر فقه اهل بیت(علیهم السلام) تکیه نموده و به شایستگی با علوم گوناگون دینی آشنا باشند. مسلمانان تنها زمانی می توانند یک زندگی آگاهانه داشته باشند و به فرموده قرآن در زمره «لِینذِر مَن کانَ حَیاً…»(یس/۷۰) قرار بگیرند که آگاهی عمیق تری درباره آموزه های اسلامی و الگوهای پیشنهادی آن برای سبک زندگی فردی و اجتماعی کسب نمایند و سپس برای تحقق این الگوها تلاش کنند. تنها در این صورت است که حیات دوباره و تمدن بالنده نصیب مسلمانان خواهد شد. ولی اگر پژوهشگر حوزه دین، تنها از تمدن و فرهنگ سکولار و مادی غرب انتقاد کرده و از گذشته فرهنگ و تمدن اسلامی تمجید نماید، راه به جایی نخواهیم برد و نمی توانیم دوباره تمدنی اسلامی را بنیان نهیم. ما باید این نکته را بپذیریم که از آموزه های اسلام و سبک زندگی اسلامی فاصله گرفته ایم و اکنون باید با یک چرخش فرهنگی و اجتماعی به اسلام و الگوهای مطلوب آن برای زندگی بازگردیم. هدف از این بازگشت، ساختن یک تمدن نوین اسلامی بر اساس فرهنگ اصیل اسلامی و با استفاده از همه تجربه های مباح بشری است؛ و البته بازخوانی آموزه های دینی برای تعریف و ارائه سبک زندگی متناسب با نیازهای زمانه، بدان معنا نیست که مفاهیم اسلامی را از جوهره آن تهی سازیم؛ بلکه باید مفاهیم به گونه ای تحلیل شوند که در آن عقلانیت با معنویت، قدرت با اخلاق، دانش با ارزش و علم با عمل جمع گردد؛ و خلاقیت و اصول گرایی در هم آمیزد.\n" +
                "\n" +
                "ب) آینده نگری و توجه به پیامدهای رفتار، یکی از توصیه های مهم در آموزه های اسلامی است که می تواند چارچوبی برای سبک زندگی اسلامی و نقشه راهی برای شکل گیری تمدن نوین اسلامی باشد. دین اسلام علاوه بر نوید آینده ای روشن در پایان تاریخ، همواره پیروان خود را به رعایت برخی امور برای ایجاد جامعه ای مطلوب در هر عصر و زمانی دعوت کرده است. توجه ویژه آموزه های شیعی به مسئله «انتظار»، مستلزم احراز شرایط و شاخص هایی است که نشانگر برخی مراتب حداقلی در جامعه مطلوب اسلامیبه شمار می رود. پس شکوه و عظمتی که در روایات متعدد اسلامی برای جامعه و حکومت مهدوی ترسیم گردیده، نمی تواند تنها برای ارائه دورنمایی از انگاره آخرالزمان باشد؛ بلکه مخاطب آن، تمام مسلمانان و چه بسا همه انسان ها در تمامی قرون و اعصار است تا با الگوگیری از آن جامعه آرمانی و موعود، تمدنی شایسته و بایسته را برای جوامع معاصر خود، پی ریزی نمایند. با تکیه بر مفروضاتی مانند: فرآیندی بودن شکل گیری جامعه آرمانی اسلام و تأکید اسلام بر اختیار و نقش انسان ها و جوامع در روند شکل گیری جامعه مطلوب، می توان گفت جامعه مطلوب اسلامی دارای مراتب تشکیکی بوده و در هر عصری با توجه به اقتضائات زمانی و مکانی، برخی از ویژگی های مورد نظر اسلام درباره جامعه مطلوب انسانی، قابلیت تحقق دارد؛ اما نکته اساسی و مهم آن است که جامعه اسلامی همواره بکوشد تا حرکتش، حرکتی تکاملی و رو به رشد بوده و همواره نوعی آینده پژوهی دینی را مد نظر قرار دهد که در تعیین ارزش ها و هنجـارهای جامعـه موجود و نیـز جهت دادن به نحوه کنش های اجتماعی اثرگذار باشد. مراد از آینده پژوهی دینی، کشف آینده و ساختن آن بر اساس انگاره ها و گزاره های دینی است که تلفیقی از آینده پژوهی قدسی و آینده پژوهی عرفی است. منظور ما از آینده پژوهی قدسی، تمام آن چیزی است که در سطوح کلان آینده نگری دینی مطرح گردیده و چشم اندازی روشن از فرجام جامعه بشری و دورنمایی شفاف از فرجام هستی ارائه می دهد و ما را به هوشیاری بیشتر و فاعلیت مؤثرتر برای ساختن جهانی عاری از نابرابری و ظلم و سرشار از صلح و عدالت و سعادت فرامی خواند؛ و منظور از آینده پژوهی عرفی نیز همان دانش آینده پژوهی رایج و متداول تجربی است که انتظارات حداقلی بشر را برآورده می سازد. در این راستا، می توان انتظارات عرفـی جامعه را در قالب چشم اندازهای طراحی شده در محدوده های زمانی مختلف، به گونه ای تعریف نمود که همواره به صورت گام های پی در پی، برای نزدیک شدن به آرمان های بلند اسلامی باشد. پس آینده پژوهان دین باور، برای گام نخست باید چشم اندازی قدسی که مبتنی بر آموزه های برگرفته از آیات قرآن و روایات معصومان باشد، بیافرینند و هم زمان تلاش نمایند تا از طریق ایجاد یک چارچوب نظری عملی، این چشم انداز قدسی را در نظام برنامه ریزی جامعه بگنجانند؛ و البته این امری است که در جوهر آموزه های شیعـی نهفته است، اما مهم آن است که این آینده اندیشی که گاه در نیمه پنهان اذهان ما جای گرفته باید در زندگی ما ظهوری مؤثر پیدا کند.\n" +
                "\n" +
                "نتیجه\n" +
                "الف) آموزه های آسمانی دین اسلام، همواره هویت و شخصیت انسان را در مرکز توجه خود قرار داده و با آماده سازی انسان از طریق تعریف معنای غایی زندگی و با القای حس تعلق به آن در قبال اجتماع مذهبی، به گونه چشم گیری در تعریف افراد از هویت فرهنگی خویش ایفای نقش می نماید. بر اساس هویتی که در پرتو دین به دست می آید انسان، بنده ای مخلوق و مسئول در برابر اعمال خود معرفی می شود و حیات مادی و زندگی این جهانی او نیز به مثابه پلی تصویر می شود که ناگزیر باید از آن بگذرد و به جهان باقی رهسپار گردد. فرهنگی که عقبه فکری و معرفتی آن را چنین آموزه هایی تشکیل می دهد، الگوهایی را برای زیست بهتر انسان در این جهان تعریف و ارائه می کند که در چارچوب نظام معنایی توحیدی بوده و برخاسته از باورها و ارزش های اسلامی باشد. این سبک زندگی و الگوهای آن، نیازها و خواسته های انسان مسلمان و جامعه اسلامی را جهت دهی کرده و علاوه بر آن، شیوه های برآوردن این نیازها را نیز تعریف و تبیین می کند. مبنا قرار دادن الگوهای این سبک زندگی از سوی جامعه اسلامی، متضمن انتخاب و استفاده از ابزارها و امکاناتی است که متناسب با این الگوها باشد. پس یک جامعه دین مدار به صورت کاملاً خودخواسته، تمدن خود را به گونه ای پی ریزی می کند که او را در مسیر سعادت جاودان قرار دهد. بدین ترتیب، حتی اگر برخی از مظاهر تمدنی مانند توجه به رفاه و آسایش اجتماعی در ظاهر یکسان باشد، عقبه معرفتی آن کاملاً متفاوت خواهد بود.\n" +
                "\n" +
                "ب) دین و آموزه های آن تا زمانی که از تحریف و انحراف به دور باشد، بر اساس اقتضائات جامعه بشری در هر برهه ای از تاریخ، مراحلی از تحقق جامعه مطلوب را نیز مورد توجه قرار می دهد و از پیروان خود می خواهد تا در حد توان و امکانات اجتماعی خویش، برای برقراری یک جامعه مطلوب و مبتنی بر ارزش های دینی تلاش کنند. بدین ترتیب، ارزش های ثابت دینی بر اساس اقتضائات اجتماعی می تواند در هر زمانی، به هنجارهای متعارف اجتماعی تبدیل شده و روابط اجتماعی را سامان دهد؛ و البته این هنجارها کاملاً انعطاف پذیر بوده و بر اساس نیازهای نوین اجتماعی، از قابلیت دگرگونی و تحول نیز برخوردار است.\n" +
                "\n" +
                "ج) دقت و ژرف اندیشی در آموزه های اسلام، هر اندیشمند منصفی را به این نتیجه می رساند که وضعیت موجود مسلمانان لزوماً نمی تواند یک وضعیت پایدار تلقی شود و قابلیت تحول و تغییر را خواهد داشت؛ تا جایی که به باور بسیاری از اندیشمندان مسلمان معاصر، جهان اسلام بار دیگر در آستانه اوج گیری برای ایجاد تمدنی نوین قرار دارد. آن چه در حال حاضر می تواند کارگشا باشد آن است که توان و نیروی علمی خود را در بحث پیرامون گذشته تمدن اسلامی و عظمت و شکوه آن محدود نکرده و با گذار از این مباحث، امکان تصور و ترسیم تمدن اسلامی در زمان حال و آینده را بررسی کنیم. این مسأله نیز زمانی حل خواهد شد که ظرفیت های موجود در آموزه های اسلامی برای اثرگذاری بر فرهنگ جوامع و همچنین تمدن سازی این تعالیم را شناسایی و معرفی کنیم. حاصل این تلاش، کلیتی خواهد بود که وضعیت مطلوب جامعه اسلامی را روشن می سازد که در پرتو آن و با نگاه به وضعیت فعلی خود و سنجش فاصله تا وضعیت مطلوب، می توان اقدامات لازم را برنامه ریزی کرد؛ و این همان خلق و ایجاد آینده است که در دانش آینده پژوهی از آن سخن گفته می شود.\n" +
                "\n" +
                "پی نوشت ها\n" +
                "۱٫ LifeStyle\n" +
                "۲ . Taste\n" +
                "۳ . برای مثال می توان به پژوهشی از ماکس وبر(۱۸۶۴ ۱۹۲۰ م) اشاره کرد؛ او با تاکید بر منش پارسایی بخشی از جامعه پروتستان ها که موجب پرهیز از مصرف تجملی و در نتیجه، انباشت سرمایه و سازماندهی عقلانی تولید می شد، تاثیر یک عامل فرهنگی برآمده از دین را بر نظم اقتصادی و اجتماعی جامعه مدرن توصیف کرده است.(ر.ک به: ماکس وبر، اخلاق پروتستان و روح سرمایه داری، ترجمه: عبدالمعبود انصاری)\n" +
                "۴ . تفاوت های موجود در سبک زندگی و الگوهای رفتاری سلمان و ابوذر که پیامبر میان ایشان عقد برادری بسته بود و هر دو را بارها مورد ستایش قرار داده، نمونه خوبی است. ما به هیچ وجه در سیره پیامبر اسلام نمی بینیم که به سلمان توصیه کرده باشد تا مانند ابوذر زندگی کند؛ و از آن طرف روایت شده که اگر ابوذر از قلب سلمان آگاه می شد، بی شک، او را نفی می کرد(کلینی، ۱۳۸۲: ج ۱: ۴۵۵). تفاوت الگوهای رفتاری امامان معصوم شیعه در شرایط متفاوت اجتماعی نیز گویای همین مدعا می باشد(حمیری، ۱۴۱۷ ق، ح ۱۲۹۶: ۲۸۶؛ إربلی، ۱۴۲۶ ق، ج ۳: ۴۲۳؛ ابن صباغ، ۱۳۸۵: ۳۸۹).\n" +
                "۵ . تمایلات و ترجیحات فردی و جمعی، جهت کُنش را تعیین می کند؛ و منابع در دسترس که در پیوند با عوامل ساختاری، فرصت های زندگی را پدید می آورند، بستر بروز کُنش را فراهم می سازند.\n" +
                "۶٫ گروه های مرجع در اصطلاح جامعه شناسی به مجموعه های انسانی برخوردار از ویژگی های خاص از حیث پایگاه، هنجار و نقش اطلاق می شود که افراد برای داوری یا ارزیابی خود، آن ها را به عنوان معیار و میزان مورد توجه قرار داده و بر اساس آن، بینش، گرایش و کنش خود را شکل می دهند(کوئن، ۱۳۸۰: ۱۳۸)." +
                "" +
                "");
    }

    private void data3() {
        txt_detail.setText("" +
                "انقلاب کبیر اسلامی ایران در حالی چهلمین سالگرد پیروزی خود را پشت سر گذاشت و قدم به دهه\u200Cی پنجم حیات خود نهاد که اگرچه دشمنان مستکبرش گمان\u200Cهای باطلی در سر داشتند اما دوستانش در سراسر جهان، امیدوارانه آن را در گذر از چالش\u200Cها و به دست آوردن پیشرفت\u200Cهای خیره\u200Cکننده، همواره سربلند دیده\u200Cاند.\n" +
                "در چنین نقطه\u200Cی عطفی، رهبر حکیم انقلاب اسلامی با صدور «بیانیه\u200Cی گام دوم انقلاب» و برای ادامه\u200Cی این راه روشن، به تبیین دستاوردهای شگرف چهار دهه\u200Cی گذشته پرداخته و توصیه\u200Cهایی اساسی به\u200Cمنظور «جهاد بزرگ برای ساختن ایران اسلامی بزرگ» ارائه فرموده\u200Cاند.\n" +
                "بیانیه\u200Cی «گام دوم انقلاب» تجدید مطلعی است خطاب به ملت ایران و به\u200Cویژه جوانان که به\u200Cمثابه منشوری برای «دومین مرحله\u200Cی خودسازی، جامعه\u200Cپردازی و تمدن\u200Cسازی» خواهد بود و «فصل جدید زندگی جمهوری اسلامی» را رقم خواهد زد.\n" +
                "این گام دوم، انقلاب را «به آرمان بزرگش که ایجاد تمدن نوین اسلامی و آمادگی برای طلوع خورشید ولایت عظمیٰ (ارواحنافداه) هست» نزدیک خواهد کرد.\n" +
                "متن کامل این بیانیه به شرح زیر است." +
                "\n\n" +
                "سم الله الرّحمن الرّحیم\n" +
                "الحمدلله ربّ العالمین و الصّلاة و السّلام علی سیّدنا محمّد و آله\u200C الطّاهرین و صحبه المنتجبین و من تبعهم باحسان الی یوم الدّین.\n" +
                "\n" +
                "ورود انقلاب اسلامی به دومین مرحله\u200C\u200Cی خودسازی، جامعه\u200Cپردازی و تمدن\u200Cسازی (۱)\n" +
                "از میان همه\u200Cی ملّتهای زیر ستم، کمتر ملّتی به انقلاب همّت میگمارد؛ و در میان ملّتهایی که به\u200Cپاخاسته و انقلاب کرده\u200Cاند، کمتر دیده شده که توانسته باشند کار را به نهایت رسانده و به\u200Cجز تغییر حکومتها، آرمانهای انقلابی را حفظ کرده باشند. امّا انقلاب پُرشکوه ملّت ایران که بزرگ\u200Cترین و مردمی\u200Cترین انقلاب عصر جدید است، تنها انقلابی است که یک چلّه\u200Cی پُرافتخار را بدون خیانت به آرمانهایش پشت سر نهاده و در برابر همه\u200Cی وسوسه\u200Cهایی که غیر قابل مقاومت به نظر میرسیدند، از کرامت خود و اصالت شعارهایش صیانت کرده و اینک وارد دوّمین مرحله\u200Cی خودسازی و جامعه\u200Cپردازی و تمدّن\u200Cسازی شده \u200Cاست. درودی از اعماق دل بر این ملّت؛ بر نسلی که آغاز کرد و ادامه داد و بر نسلی که اینک وارد فرایند بزرگ و جهانیِ چهل سال دوّم میشود.\n" +
                "\n" +
                "پیروزی انقلاب اسلامی؛ آغازگر عصر جدید عالم\n" +
                "آن روز که جهان میان شرق و غرب مادّی تقسیم شده بود و کسی گمان یک نهضت بزرگ دینی را نمیبُرد، انقلاب اسلامی ایران، با قدرت و شکوه پا به میدان نهاد؛ چهارچوب\u200Cها را شکست؛ کهنگی کلیشه\u200Cها را به رخ دنیا کشید؛ دین و دنیا را در کنار هم مطرح کرد و آغاز عصر جدیدی را اعلام نمود. طبیعی بود که سردمداران گمراهی و ستم واکنش نشان دهند، امّا این واکنش ناکام ماند. چپ و راستِ مدرنیته، از تظاهر به نشنیدن این صدای جدید و متفاوت، تا تلاش گسترده و گونه\u200Cگون برای خفه کردن آن، هرچه کردند به اجلِ محتوم خود نزدیک\u200Cتر شدند. اکنون با گذشت چهل جشن سالانه\u200Cی انقلاب و چهل دهه\u200Cی فجر، یکی از آن دو کانون دشمنی نابود شده و دیگری با مشکلاتی که خبر از نزدیکی احتضار میدهند، دست\u200Cوپنجه نرم میکند! و انقلاب اسلامی با حفظ و پایبندی به شعارهای خود همچنان به پیش میرود.\n" +
                "\n" +
                "شعارهای جهانی، فطری، درخشان و همیشه\u200Cزنده\u200Cی انقلاب اسلامی\n" +
                "برای همه\u200Cچیز میتوان طول عمر مفید و تاریخ مصرف فرض کرد، امّا شعارهای جهانی این انقلاب دینی از این قاعده مستثنا است؛ آنها هرگز بی\u200Cمصرف و بی\u200Cفایده نخواهند شد، زیرا فطرت بشر در همه\u200Cی عصرها با آن سرشته است. آزادی، اخلاق، معنویّت، عدالت، استقلال، عزّت، عقلانیّت، برادری، هیچ یک به یک نسل و یک جامعه مربوط نیست تا در دوره\u200Cای بدرخشد و در دوره\u200Cای دیگر افول کند. هرگز نمیتوان مردمی را تصوّر کرد که از این چشم\u200Cاندازهای مبارک دل\u200Cزده شوند. هرگاه دل\u200Cزدگی پیش آمده، از روی\u200Cگردانی مسئولان از این ارزشهای دینی بوده است و نه از پایبندی به آنها و کوشش برای تحقّق آنها.\n" +
                "\n" +
                "دفاع ابدی از نظریه\u200Cی نظام انقلابی\n" +
                "انقلاب اسلامی همچون پدیده\u200Cای زنده و بااراده، همواره دارای انعطاف و آماده\u200Cی تصحیح خطاهای خویش است، امّا تجدیدنظرپذیر و اهل انفعال نیست. به نقدها حسّاسیّت مثبت نشان میدهد و آن را نعمت خدا و هشدار به صاحبان حرفهای بی\u200Cعمل میشمارد، امّا به هیچ بهانه\u200Cای از ارزشهایش که بحمدالله با ایمان دینی مردم آمیخته است، فاصله نمیگیرد. انقلاب اسلامی پس از نظام\u200Cسازی، به رکود و خموشی دچار نشده و نمیشود و میان جوشش انقلابی و نظم سیاسی و اجتماعی تضاد و ناسازگاری نمیبیند، بلکه از نظریّه\u200Cی نظام انقلابی تا ابد دفاع میکند.\n" +
                "\n" +
                "جمهوری اسلامی و فاصله\u200Cی میان بایدها و واقعیتها\n" +
                "جمهوری اسلامی، متحجّر و در برابر پدیده\u200Cها و موقعیّتهای نو به نو، فاقد احساس و ادراک نیست، امّا به اصول خود بشدّت پایبند و به مرزبندی\u200Cهای خود با رقیبان و دشمنان بشدّت حسّاس است. با خطوط اصلی خود هرگز بی\u200Cمبالاتی نمیکند و برایش مهم است که چرا بماند و چگونه بماند. بی\u200Cشک فاصله\u200Cی میان بایدها و واقعیّتها، همواره وجدانهای آرمان\u200Cخواه را عذاب داده و میدهد، امّا این، فاصله\u200Cای طی\u200Cشدنی است و در چهل سال گذشته در مواردی بارها طی شده است و بی\u200Cشک در آینده، با حضور نسل جوان مؤمن و دانا و پُرانگیزه، با قدرت بیشتر طی خواهد شد.\n" +
                "\n" +
                "انقلاب اسلامی؛ مایه\u200Cی سربلندی ایران و ایرانی\n" +
                "انقلاب اسلامی ملّت ایران، قدرتمند امّا مهربان و باگذشت و حتّی مظلوم بوده است. مرتکب افراط\u200Cها و چپ\u200Cروی\u200Cهایی که مایه\u200Cی ننگ بسیاری از قیامها و جنبشها است، نشده است. در هیچ معرکه\u200Cای حتّی با آمریکا و صدّام، گلوله\u200Cی اوّل را شلّیک نکرده و در همه\u200Cی موارد، پس \u200Cاز حمله\u200Cی دشمن از خود دفاع کرده و البتّه ضربت متقابل را محکم فرود آورده است. این انقلاب از آغاز تا امروز نه بی\u200Cرحم و خون\u200Cریز بوده و نه منفعل و مردّد. با صراحت و شجاعت در برابر زورگویان و گردنکشان ایستاده و از مظلومان و مستضعفان دفاع کرده است. این جوانمردی و مروّت انقلابی، این صداقت و صراحت و اقتدار، این دامنه\u200Cی عمل جهانی و منطقه\u200Cای در کنار مظلومان جهان، مایه\u200Cی سربلندی ایران و ایرانی است، و همواره چنین باد.\n" +
                "\n" +
                "برای برداشتن گامهای استوار در آینده، باید گذشته را درست شناخت\n" +
                "اینک در آغاز فصل جدیدی از زندگی جمهوری اسلامی، این بنده\u200Cی ناچیز مایلم با جوانان عزیزم، نسلی که پا به میدان عمل میگذارد تا بخش دیگری از جهاد بزرگ برای ساختن ایران اسلامی بزرگ را آغاز کند، سخن بگویم. سخن اوّل درباره\u200Cی گذشته است.\n" +
                "\n" +
                "عزیزان! نادانسته\u200Cها را جز با تجربه\u200Cی خود یا گوش سپردن به تجربه\u200Cی دیگران نمیتوان دانست. بسیاری از آنچه را ما دیده و آزموده\u200Cایم، نسل شما هنوز نیازموده و ندیده است. ما دیده\u200Cایم و شما خواهید دید. دهه\u200Cهای آینده دهه\u200Cهای شما است و شمایید که باید کارآزموده و پُرانگیزه از انقلاب خود حراست کنید و آن را هرچه بیشتر به آرمان بزرگش که ایجاد تمدّن نوین اسلامی و آمادگی برای طلوع خورشید ولایت عظمیٰ (ارواحنافداه) است، نزدیک کنید. برای برداشتن گامهای استوار در آینده، باید گذشته را درست شناخت و از تجربه\u200Cها درس گرفت؛ اگر از این راهبرد غفلت شود، دروغها به جای حقیقت خواهند نشست و آینده مورد تهدیدهای ناشناخته قرار خواهد گرفت. دشمنان انقلاب با انگیزه\u200Cای قوی، تحریف و دروغ\u200Cپردازی درباره\u200Cی گذشته و حتّی زمان حال را دنبال میکنند و از پول و همه\u200Cی ابزارها برای آن بهره میگیرند. رهزنان فکر و عقیده و آگاهی بسیارند؛ حقیقت را از دشمن و پیاده\u200Cنظامش نمیتوان شنید.\n" +
                "\n" +
                "آغاز انقلاب و نظام اسلامی از نقطه\u200Cی صفر\n" +
                "انقلاب اسلامی و نظام برخاسته از آن، از نقطه\u200Cی صفر آغاز شد؛ اوّلاً: همه\u200Cچیز علیه ما بود، چه رژیم فاسد طاغوت که علاوه \u200Cبر وابستگی و فساد و استبداد و کودتایی بودن، اوّلین رژیم سلطنتی در ایران بود که به دست بیگانه -و نه به زور شمشیر خود- بر سرِ کار آمده بود، و چه دولت آمریکا و برخی دیگر از دولتهای غربی، و چه وضع بشدّت نابسامان داخلی و عقب\u200Cافتادگی شرم\u200Cآور در علم و فنّاوری و سیاست و معنویّت و هر فضیلت دیگر.\n" +
                "\n" +
                "ثانیاً: هیچ تجربه\u200Cی پیشینی و راه طی\u200Cشده\u200Cای در برابر ما وجود نداشت. بدیهی است که قیامهای مارکسیستی و امثال آن نمیتوانست برای انقلابی که از متن ایمان و معرفت اسلامی پدید آمده است، الگو محسوب شود. انقلابیون اسلامی بدون سرمشق و تجربه آغاز کردند و ترکیب جمهوریّت و اسلامیّت و ابزارهای تشکیل و پیشرفت آن، جز با هدایت الهی و قلب نورانی و اندیشه\u200Cی بزرگ امام خمینی، به دست نیامد. و این نخستین درخشش انقلاب بود.\n" +
                "\n" +
                "تقابل دوگانه\u200Cی جدید «اسلام و استکبار»؛ پدیده\u200Cی برجسته\u200Cی جهان معاصر\n" +
                "پس آ\u200Cنگاه انقلاب ملّت ایران، جهان دوقطبی آن روز را به جهان سه\u200Cقطبی تبدیل کرد و سپس با سقوط و حذف شوروی و اقمارش و پدید آمدن قطبهای جدید قدرت، تقابل دوگانه\u200Cی جدید «اسلام و استکبار» پدیده\u200Cی برجسته\u200Cی جهان معاصر و کانون توجّه جهانیان شد. از سویی نگاه امیدوارانه\u200Cی ملّتهای زیر ستم و جریانهای آزادی\u200Cخواه جهان و برخی دولتهای مایل به استقلال، و از سویی نگاه کینه\u200Cورزانه و بدخواهانه\u200Cی رژیم\u200Cهای زورگو و قلدرهای باج\u200Cطلب عالم، بدان دوخته شد. بدین\u200Cگونه مسیر جهان تغییر یافت و زلزله\u200Cی انقلاب، فرعونهای در بسترِ راحت آرمیده را بیدار کرد؛ دشمنی\u200Cها با همه\u200Cی شدّت آغاز شد و اگر نبود قدرت عظیم ایمان و انگیزه\u200Cی این ملّت و رهبری آسمانی و تأییدشده\u200Cی امام عظیم\u200Cالشّأن ما، تاب آوردن در برابر آن\u200Cهمه خصومت و شقاوت و توطئه و خباثت، امکان\u200Cپذیر نمیشد.\n" +
                "\n" +
                "مدیریت جهادی و اعتقاد به اصل «ما میتوانیم»؛ عامل عزت و پیشرفت ایران در همه\u200Cی عرصه\u200Cها\n" +
                "به\u200Cرغم همه\u200Cی این مشکلات طاقت\u200Cفرسا، جمهوری اسلامی روزبه\u200Cروز گامهای بلندتر و استوارتری به جلو برداشت. این چهل سال، شاهد جهادهای بزرگ و افتخارات درخشان و پیشرفتهای شگفت\u200Cآور در ایران اسلامی است. عظمت پیشرفتهای چهل\u200Cساله\u200Cی ملّت ایران آنگاه بدرستی دیده میشود که این مدّت، با مدّتهای مشابه در انقلابهای بزرگی همچون انقلاب فرانسه و انقلاب اکتبر شوروی و انقلاب هند مقایسه شود. مدیریّتهای جهادی الهام\u200Cگرفته از ایمان اسلامی و اعتقاد به اصل «ما میتوانیم» که امام بزرگوار به همه\u200Cی ما آموخت، ایران را به عزّت و پیشرفت در همه\u200Cی عرصه\u200Cها رسانید.\n" +
                "\n" +
                "* برکات بزرگ انقلاب اسلامی:\n" +
                "انقلاب به یک انحطاط تاریخی طولانی پایان داد و کشور که در دوران پهلوی و قاجار بشدّت تحقیر شده و بشدّت عقب مانده بود، در مسیر پیشرفت سریع قرار گرفت؛ در گام نخست، رژیم ننگین سلطنت استبدادی را به حکومت مردمی و مردم\u200Cسالاری تبدیل کرد و عنصر اراده\u200Cی ملّی را که جان\u200Cمایه\u200C\u200Cی پیشرفت همه\u200Cجانبه و حقیقی است در کانون مدیریّت کشور وارد کرد؛ آنگاه جوانان را میدان\u200Cدار اصلی حوادث و وارد عرصه\u200Cی مدیریّت کرد؛ روحیه\u200C و باور «ما میتوانیم» را به همگان منتقل کرد؛ به برکت تحریم دشمنان،\u200C اتّکاء به توانایی داخلی را به همه آموخت و این منشأ برکات بزرگ شد:\n" +
                "\n" +
                "یک) ثبات و امنیت و حفظ تمامیت ارضی ایران\n" +
                "اوّلاً: ثبات و امنیّت کشور و تمامیّت ارضی و حفاظت از مرزها را که آماج تهدید جدّی دشمنان قرار گرفته بود ضمانت کرد و معجزه\u200Cی پیروزی در جنگ هشت\u200Cساله و شکست رژیم بعثی و پشتیبانان آمریکایی و اروپایی و شرقی\u200Cاش را پدید \u200Cآورد.\n" +
                "\n" +
                "دو) موتور پیشران کشور در عرصه\u200Cی علم و فنّاوری و ایجاد زیرساخت\u200Cهای حیاتی و اقتصادی و عمرانی\n" +
                "ثانیاً: موتور پیشران کشور در عرصه\u200Cی علم و فنّاوری و ایجاد زیرساخت\u200Cهای حیاتی و اقتصادی و عمرانی شد که تا اکنون ثمرات بالنده\u200Cی آن روزبه\u200Cروز فراگیرتر میشود. هزاران شرکت دانش\u200Cبنیان، هزاران طرح زیرساختی و ضروری برای کشور در حوزه\u200Cهای عمران و حمل\u200Cونقل و صنعت و نیرو و معدن و سلامت و کشاورزی و آب و غیره، میلیون\u200Cها تحصیل\u200Cکرده\u200Cی دانشگاهی یا در حال تحصیل، هزاران واحد دانشگاهی در سراسر کشور، ده\u200Cها طرح بزرگ از قبیل چرخه\u200Cی سوخت هسته\u200Cای، سلّول\u200Cهای بنیادی، فنّاوری نانو، زیست\u200Cفنّاوری و غیره با رتبه\u200Cهای نخستین در کلّ جهان، شصت برابر شدن صادرات غیرنفتی، نزدیک به ده برابر شدن واحدهای صنعتی، ده\u200Cها برابر شدن صنایع از نظر کیفی، تبدیل صنعت مونتاژ به فنّاوری بومی، برجستگی محسوس در رشته\u200Cهای گوناگون مهندسی از جمله در صنایع دفاعی، درخشش در رشته\u200Cهای مهم و حسّاس پزشکی و جایگاه مرجعیّت در آن و ده\u200Cها نمونه\u200Cی دیگر از پیشرفت، محصول آن روحیه و آن حضور و آن احساس جمعی است که انقلاب برای کشور به ارمغان آورد. ایرانِ پیش \u200Cاز انقلاب، در تولید علم و فنّاوری صفر بود، در صنعت به\u200Cجز مونتاژ و در علم به\u200Cجز ترجمه هنری نداشت.\n" +
                "\n" +
                "سه) به اوج رسانیدن مشارکت مردمی و مسابقه\u200Cی خدمت\u200Cرسانی\n" +
                "ثالثاً: مشارکت مردمی را در مسائل سیاسی مانند انتخابات، مقابله با فتنه\u200Cهای داخلی، حضور در صحنه\u200Cهای ملّی و استکبارستیزی به اوج رسانید و در موضوعات اجتماعی مانند کمک\u200Cرسانی\u200Cها و فعّالیّتهای نیکوکاری که از پیش \u200Cاز انقلاب آغاز شده بود، افزایش چشمگیر داد. پس \u200Cاز انقلاب، مردم در مسابقه\u200C\u200Cی خدمت\u200Cرسانی در حوادث طبیعی و کمبودهای اجتماعی مشتاقانه شرکت میکنند.\n" +
                "\n" +
                "چهار) ارتقاء شگفت\u200Cآور بینش سیاسی آحاد مردم\n" +
                "رابعاً: بینش سیاسی آحاد مردم و نگاه آنان به مسائل بین\u200Cالمللی را به گونه\u200Cی شگفت\u200Cآوری ارتقاء داد. تحلیل سیاسی و فهم مسائل بین\u200Cالمللی در موضوعاتی همچون جنایات غرب بخصوص آمریکا، مسئله\u200Cی فلسطین و ظلم تاریخی به ملّت آن، مسئله\u200Cی جنگ\u200Cافروزی\u200Cها و رذالتها و دخالتهای قدرتهای قلدر در امور ملّتها و امثال آن را از انحصار طبقه\u200Cی محدود و عزلت\u200C\u200Cگزیده\u200Cای به نام روشنفکر، بیرون آورد؛ این\u200Cگونه، روشنفکری میان عموم مردم در همه\u200Cی کشور و همه\u200Cی ساحتهای زندگی جاری شد و مسائلی از این دست حتّی برای نوجوانان و نونهالان، روشن و قابل فهم گشت.\n" +
                "\n" +
                "پنج) سنگین کردن کفه\u200Cی عدالت در تقسیم امکانات عمومی کشور\n" +
                "خامساً: کفّه\u200Cی عدالت را در تقسیم امکانات عمومی کشور سنگین کرد. نارضایتی این حقیر از کارکرد عدالت در کشور به دلیل آنکه این ارزش والا باید گوهر بی\u200Cهمتا بر تارک نظام جمهوری اسلامی باشد و هنوز نیست، نباید به این معنی گرفته شود که برای استقرار عدالت کار انجام نگرفته است. واقعیّت آن است که دستاوردهای مبارزه با بی\u200Cعدالتی در این چهار دهه، با هیچ دوره\u200Cی دیگر گذشته قابل مقایسه نیست. در رژیم طاغوت بیشترین خدمات و درآمدهای کشور در اختیار گروه کوچکی از پایتخت\u200Cنشینان یا همسانان آنان در برخی دیگر از نقاط کشور بود. مردم بیشتر شهرها بویژه مناطق دوردست و روستاها در آخر فهرست و غالباً محروم از نیازهای اوّلیّه\u200Cی زیرساختی و خدمت\u200Cرسانی بودند. جمهوری اسلامی در شمار موفّق\u200Cترین حاکمیّتهای جهان در جابه\u200Cجایی خدمت و ثروت از مرکز به همه\u200Cجای کشور، و از مناطق مرفّه\u200Cنشین شهرها به مناطق پایین\u200Cدست آن بوده است. آمار بزرگ راه\u200Cسازی و خانه\u200Cسازی و ایجاد مراکز صنعتی و اصلاح امور کشاورزی و رساندن برق و آب و مراکز درمانی و واحدهای دانشگاهی و سد و نیروگاه و امثال آن به دورترین مناطق کشور، حقیقتاً افتخارآفرین است؛ بی\u200Cشک این همه، نه در تبلیغات نارسای مسئولان انعکاس یافته\u200C و نه زبان بدخواهان خارجی و داخلی به آن اعتراف کرده است؛ ولی هست و حسنه\u200Cای برای مدیران جهادی و بااخلاص نزد خدا و خلق است. البتّه عدالت مورد انتظار در جمهوری اسلامی که مایل است پیرو حکومت علوی شناخته شود، بسی برتر از اینها است و چشم امید برای اجرای آن به شما جوانها است که در ادامه بدان خواهم پرداخت.\n" +
                "\n" +
                "شش) افزایش چشمگیر معنویت و اخلاق در فضای عمومی جامعه\n" +
                "سادساً: عیار معنویّت و اخلاق را در فضای عمومی جامعه بگونه\u200Cای چشمگیر افزایش داد. این پدیده\u200Cی مبارک را رفتار و منش حضرت امام خمینی در طول دوران مبارزه و پس \u200Cاز پیروزی انقلاب، بیش \u200Cاز هر چیز رواج داد؛ آن انسان معنوی و عارف و وارسته از پیرایه\u200Cهای مادّی، در رأس کشوری قرار گرفت که مایه\u200Cهای ایمان مردمش بسی ریشه\u200Cدار و عمیق بود. هرچند دست تطاول تبلیغات مروّج فساد و بی\u200Cبندوباری در طول دوران پهلوی\u200Cها به آن ضربه\u200Cهای سخت زده و لجنزاری از آلودگی اخلاقی غربی را به درون زندگی مردم متوسّط و بخصوص جوانان کشانده بود، ولی رویکرد دینی و اخلاقی در جمهوری اسلامی، دلهای مستعد و نورانی بویژه جوانان را مجذوب کرد و فضا به سود دین و اخلاق دگرگون شد. مجاهدتهای جوانان در میدانهای سخت از جمله دفاع مقدّس، با ذکر و دعا و روحیه\u200Cی برادری و ایثار همراه شد و ماجراهای صدر اسلام را زنده و نمایان در برابر چشم همه نهاد. پدران و مادران و همسران با احساس وظیفه\u200Cی دینی از عزیزان خود که به جبهه\u200Cهای گوناگون جهاد می\u200Cشتافتند دل کندند و سپس، آنگاه که با پیکر خون\u200Cآلود یا جسم آسیب\u200Cدیده\u200Cی آنان روبه\u200Cرو شدند، مصیبت را با شکر همراه کردند. مساجد و فضاهای دینی رونقی بی\u200Cسابقه گرفت. صف نوبت برای اعتکاف از هزاران جوان و استاد و دانشجو و زن و مرد و صف نوبت برای اردوهای جهادی و جهاد سازندگی و بسیج سازندگی از هزاران جوان داوطلب و فداکار آکنده شد. نماز و حج و روزه\u200Cداری و پیاده\u200Cروی زیارت و مراسم گوناگون دینی و انفاقات و صدقات واجب و مستحب در همه\u200Cجا بویژه میان جوانان رونق یافت و تا امروز، روزبه\u200Cروز بیشتر و باکیفیّت\u200Cتر شده است. و اینها همه در دورانی اتّفاق افتاده که سقوط اخلاقی روزافزون غرب و پیروانش و تبلیغات پُرحجم آنان برای کشاندن مرد و زن به لجنزارهای فساد، اخلاق و معنویّت را در بخشهای عمده\u200Cی عالم منزوی کرده است؛ و این معجزه\u200Cای دیگر از انقلاب و نظام اسلامی فعّال و پیشرو است.\n" +
                "\n" +
                "هفت) ایستادگی روزافزون در برابر قلدران و زورگویان و مستکبران جهان\n" +
                "سابعاً: نماد پُرابّهت و باشکوه و افتخارآمیز ایستادگی در برابر قلدران و زورگویان و مستکبران جهان و در رأس آنان آمریکای جهان\u200Cخوار و جنایت\u200Cکار، روزبه\u200Cروز برجسته\u200Cتر شد. در تمام این چهل سال، تسلیم\u200Cناپذیری و صیانت و پاسداری از انقلاب و عظمت و هیبت الهی آن و گردن برافراشته\u200Cی آن در مقابل دولتهای متکبّر و مستکبر، خصوصیّت شناخته\u200Cشده\u200Cی ایران و ایرانی بویژه جوانان این مرز و بوم به\u200Cشمار میرفته است. قدرتهای انحصارگر جهان که همواره حیات خود را در دست\u200Cاندازی به استقلال دیگر کشورها و پایمال کردن منافع حیاتی آنها برای مقاصد شوم خود دانسته\u200Cاند، در برابر ایران اسلامی و انقلابی، اعتراف به ناتوانی کردند. ملّت ایران در فضای حیات\u200Cبخش انقلاب توانست نخست دست\u200Cنشانده\u200Cی آمریکا و عنصر خائن به ملّت را از کشور برانَد و پس از \u200Cآن هم تا امروز از سلطه\u200Cی دوباره\u200Cی قلدران جهانی بر کشور با قدرت و شدّت جلوگیری کند.\n" +
                "\n" +
                "* انقلاب چهل\u200Cساله و گام بزرگ دوم\n" +
                "جوانان عزیز! اینها بخشی محدود از سرفصل\u200Cهای عمده در سرگذشت چهل\u200Cساله\u200Cی انقلاب اسلامی است؛ انقلاب عظیم و پایدار و درخشانی که شما به توفیق الهی باید گام بزرگ دوّم را در پیشبرد آن بردارید.\n" +
                "\n" +
                "محصول تلاش چهل\u200Cساله، اکنون برابر چشم ما است: کشور و ملّتی مستقل، آزاد، مقتدر، باعزّت، متدیّن، پیشرفته در علم، انباشته از تجربه\u200Cهایی گران\u200Cبها، مطمئن و امیدوار، دارای تأثیر اساسی در منطقه و دارای منطق قوی در مسائل جهانی، رکورددار در شتاب پیشرفتهای علمی، ر کورددار در رسیدن به رتبه\u200Cهای بالا در دانشها و فنّاوری\u200Cهای مهم از قبیل هسته\u200Cای و سلّول\u200Cهای بنیادی و نانو و هوافضا و امثال آن، سرآمد در گسترش خدمات اجتماعی، سرآمد در انگیزه\u200Cهای جهادی میان جوانان، سرآمد در جمعیّت جوان کارآمد، و بسی ویژگی\u200Cهای افتخارآمیز دیگر که همگی محصول انقلاب و نتیجه\u200Cی جهت\u200Cگیری\u200Cهای انقلابی و جهادی است. و بدانید که اگر بی\u200Cتوجّهی به شعارهای انقلاب و غفلت از جریان انقلابی در برهه\u200Cهایی از تاریخ چهل\u200Cساله نمیبود -که متأسّفانه بود و خسارت\u200Cبار هم بود- بی\u200Cشک دستاوردهای انقلاب از این بسی بیشتر و کشور در مسیر رسیدن به آرمانهای بزرگ بسی جلوتر بود و بسیاری از مشکلات کنونی وجود نمیداشت.\n" +
                "\n" +
                "اقتدار انقلاب اسلامی و تغییر چالشها و شکست مستکبران\n" +
                "ایران مقتدر، امروز هم مانند آغاز انقلاب با چالشهای مستکبران روبه\u200Cرو است امّا با تفاوتی کاملاً معنی\u200Cدار. اگر آن روز چالش با آمریکا بر سر کوتاه کردن دست عمّال بیگانه یا تعطیلی سفارت رژیم صهیونیستی در تهران یا رسوا کردن لانه\u200Cی جاسوسی بود، امروز چالش بر سرِ حضور ایران مقتدر در مرزهای رژیم صهیونیستی و برچیدن بساط نفوذ نامشروع آمریکا از منطقه\u200Cی غرب آسیا و حمایت جمهوری اسلامی از مبارزات مجاهدان فلسطینی در قلب سرزمین\u200Cهای اشغالی و دفاع از پرچم برافراشته\u200Cی حزب\u200Cالله و مقاومت در سراسر این منطقه است. و اگر آن روز، مشکل غرب جلوگیری از خرید تسلیحات ابتدایی برای ایران بود،\u200C امروز مشکل او جلوگیری از انتقال سلاحهای پیشرفته\u200Cی ایرانی به نیروهای مقاومت است. و اگر آن روز گمان آمریکا آن بود که با چند ایرانی خودفروخته یا با چند هواپیما و بالگرد خواهد توانست بر نظام اسلامی و ملّت ایران فائق آید، امروز برای مقابله\u200Cی سیاسی و امنیّتی با جمهوری اسلامی، خود را محتاج به یک ائتلاف بزرگ از ده\u200Cها دولت معاند یا مرعوب میبیند و البتّه باز هم در رویارویی، شکست میخورد. ایران به برکت انقلاب، اکنون در جایگاهی متعالی و شایسته\u200Cی ملّت ایران در چشم جهانیان و عبورکرده از بسی گردنه\u200Cهای دشوار در مسائل اساسی خویش است.\n" +
                "\n" +
                "جوانان؛ محور تحقق نظام پیشرفته\u200Cی اسلامی\n" +
                "امّا راه طی\u200Cشده فقط قطعه\u200Cای از مسیر افتخارآمیز به سوی آرمانهای بلند نظام جمهوری اسلامی است. دنباله\u200Cی این مسیر که به گمان زیاد، به دشواریِ گذشته\u200Cها نیست، باید با همّت و هشیاری و سرعت عمل و ابتکار شما جوانان طی شود. مدیران جوان، کارگزاران جوان، اندیشمندان جوان، فعّالان جوان، در همه\u200Cی میدانهای سیاسی و اقتصادی و فرهنگی و بین\u200Cالمللی و نیز در عرصه\u200Cهای دین و اخلاق و معنویّت و عدالت، باید شانه\u200Cهای خود را به زیر بار مسئولیّت دهند، از تجربه\u200Cها و عبرتهای گذشته بهره گیرند، نگاه انقلابی و روحیه\u200Cی انقلابی و عمل جهادی را به کار بندند و ایران عزیز را الگوی کامل نظام پیشرفته\u200Cی اسلامی بسازند.\n" +
                "\n" +
                "نیروی انسانی مستعد و کارآمد با زیربنای عمیق و اصیل ایمانی و دینی؛ مهم\u200Cترین ظرفیت امیدبخش کشور\n" +
                "نکته\u200Cی مهمّی که باید آینده\u200Cسازان در نظر داشته باشند، این است که در کشوری زندگی میکنند که از نظر ظرفیّتهای طبیعی و انسانی، کم\u200Cنظیر است و بسیاری از این ظرفیّتها با غفلت دست\u200Cاندرکاران تاکنون بی\u200Cاستفاده یا کم\u200Cاستفاده مانده است. همّتهای بلند و انگیزه\u200Cهای جوان و انقلابی، خواهند توانست آنها را فعّال و در پیشرفت مادّی و معنوی کشور به معنی واقعی جهش ایجاد کنند.\n" +
                "\n" +
                "مهم\u200Cترین ظرفیّت امیدبخش کشور، نیروی انسانی مستعد و کارآمد با زیربنای عمیق و اصیل ایمانی و دینی است. جمعیّت جوان زیر ۴۰ \u200Cسال که بخش مهمّی از آن نتیجه\u200Cی موج جمعیّتی ایجادشده در دهه\u200Cی ۶۰ است، فرصت ارزشمندی برای کشور است. ۳۶ میلیون نفر در سنین میانه\u200Cی ۱۵ و ۴۰ سالگی، نزدیک به ۱۴ میلیون نفر دارای تحصیلات عالی، رتبه\u200Cی دوّم جهان در دانش\u200Cآموختگان علوم و مهندسی، انبوه جوانانی که با روحیه\u200Cی انقلابی رشد کرده و آماده\u200Cی تلاش جهادی برای کشورند، و جمع چشمگیر جوانان محقّق و اندیشمندی که به آفرینشهای علمی و فرهنگی و صنعتی و غیره اشتغال دارند؛ اینها ثروت عظیمی برای کشور است که هیچ اندوخته\u200Cی مادّی با آن مقایسه نمیتواند شد.\n" +
                "\n" +
                "فهرست طولانی فرصتهای مادی کشور\n" +
                "به\u200Cجز اینها، فرصتهای مادّی کشور نیز فهرستی طولانی را تشکیل میدهد که مدیران کارآمد و پُرانگیزه و خردمند میتوانند با فعّال کردن و بهره\u200Cگیری از آن، درآمدهای ملّی را با جهشی نمایان افزایش داده و کشور را ثروتمند و بی\u200Cنیاز و به معنی واقعی دارای اعتمادبه\u200Cنفس کنند و مشکلات کنونی را برطرف نمایند. ایران با دارا بودن یک درصد جمعیّت جهان، دارای ۷ درصد ذخایر معدنی جهان است: منابع عظیم زیرزمینی، موقعیت استثنائی جغرافیایی میان شرق و غرب و شمال و جنوب، بازار بزرگ ملّی، بازار بزرگ منطقه\u200Cای با داشتن ۱۵ همسایه با ۶۰۰ میلیون جمعیّت، سواحل دریایی طولانی، حاصلخیزی زمین با محصولات متنوّع کشاورزی و باغی، اقتصاد بزرگ و متنوّع، بخشهایی از ظرفیّتهای کشور است؛ بسیاری از ظرفیّتها دست\u200Cنخورده مانده است. گفته شده\u200C است که ایران از نظر ظرفیّتهای استفاده\u200Cنشده\u200Cی طبیعی و انسانی در رتبه\u200Cی اوّل جهان است. بی\u200Cشک شما جوانان مؤمن و پُرتلاش خواهید توانست این عیب بزرگ را برطرف کنید. دهه\u200Cی دوّم چشم\u200Cانداز، باید زمان تمرکز بر بهره\u200Cبرداری از دستاوردهای گذشته و نیز ظرفیّتهای استفاده\u200Cنشده باشد و پیشرفت کشور از جمله در بخش تولید و اقتصاد ملّی ارتقاء یابد.\n" +
                "\n" +
                "* گام دوم و سرفصلها و توصیه\u200Cهای اساسی در پرتو امید و نگاه خوش\u200Cبینانه به آینده\n" +
                "اکنون به شما فرزندان عزیزم در مورد چند سرفصل اساسی توصیه\u200Cهایی میکنم. این سرفصل\u200Cها عبارتند از: علم و پژوهش، معنویّت و اخلاق، اقتصاد، عدالت و مبارزه با فساد، استقلال و آزادی، عزّت ملّی و روابط خارجی و مرزبندی با دشمن، سبک زندگی.\n" +
                "\n" +
                "امّا پیش از همه\u200Cچیز، نخستین توصیه\u200Cی من امید و نگاه خوش\u200Cبینانه به آینده است. بدون این کلید اساسیِ همه\u200Cی قفلها، هیچ گامی نمیتوان برداشت. آنچه میگویم یک امید صادق و متّکی به واقعیّتهای عینی است. اینجانب همواره از امید کاذب و فریبنده\u200C دوری جسته\u200Cام، امّا خود و همه را از نومیدی بیجا و ترس کاذب نیز برحذر داشته\u200C\u200Cام و برحذر میدارم. در طول این چهل سال -و اکنون مانند همیشه- سیاست تبلیغی و رسانه\u200Cای دشمن و فعّال\u200Cترین برنامه\u200Cهای آن، مأیوس\u200Cسازی مردم و حتّی مسئولان و مدیران ما از آینده است. خبرهای دروغ، تحلیل\u200Cهای مغرضانه، وارونه\u200C نشان دادن واقعیّتها، پنهان کردن جلوه\u200Cهای امیدبخش، بزرگ کردن عیوب کوچک و کوچک نشان دادن یا انکار محسّنات بزرگ، برنامه\u200C\u200Cی همیشگی هزاران رسانه\u200Cی صوتی و تصویری و اینترنتی دشمنان ملّت ایران است؛ و البتّه دنباله\u200Cهای آنان در داخل کشور نیز قابل مشاهده\u200Cاند که با استفاده از آزادی\u200Cها در خدمت دشمن حرکت میکنند. شما جوانان باید پیش\u200Cگام در شکستن این محاصره\u200Cی تبلیغاتی باشید. در خود و دیگران نهال امید به آینده را پرورش دهید. ترس و نومیدی را از خود و دیگران برانید. این نخستین و ریشه\u200Cای\u200Cترین جهاد شما است. نشانه\u200Cهای امیدبخش -که به برخی از آنها اشاره شد- در برابر چشم شما است. رویشهای انقلاب بسی فراتر از ریزشها است و دست\u200Cودلهای امین و خدمتگزار، بمراتب بیشتر از مفسدان و خائنان و کیسه\u200Cدوختگان است. دنیا به جوان ایرانی و پایداری ایرانی و ابتکارهای ایرانی، در بسیاری از عرصه\u200Cها با چشم تکریم و احترام مینگرد. قدر خود را بدانید و با قوّت خداداد، به سوی \u200Cآینده خیز بردارید و حماسه بیافرینید.\n" +
                "و امّا توصیه\u200Cها:\n" +
                "\n" +
                "یک) علم و پژوهش\n" +
                "۱) علم و پژوهش: دانش،\u200C آشکارترین وسیله\u200Cی عزّت و قدرت یک کشور است. روی دیگر دانایی، توانایی است. دنیای غرب به برکت دانش خود بود که توانست برای خود ثروت و نفوذ و قدرت دویست\u200Cساله فراهم کند و با وجود تهیدستی در بنیانهای اخلاقی و اعتقادی، با تحمیل سبک زندگی غربی به جوامع عقب\u200Cمانده از کاروان علم، اختیار سیاست و اقتصاد آنها را به دست گیرد. ما به سوءاستفاده از دانش مانند آنچه غرب کرد، توصیه نمیکنیم، امّا مؤکّداً به نیاز کشور به جوشاندن چشمه\u200Cی دانش در میان خود اصرار می\u200Cورزیم. بحمدالله استعداد علم و تحقیق در ملّت ما از متوسّط جهان بالاتر است. اکنون نزدیک به دو دهه است که رستاخیز علمی در کشور آغاز شده و با سرعتی که برای ناظران جهانی غافلگیرکننده بود -یعنی یازده برابر شتاب رشد متوسّط علم در جهان- به پیش رفته است. دستاوردهای دانش و فنّاوری ما در این مدّت که ما را به رتبه\u200Cی شانزدهم در میان بیش از دویست کشور جهان رسانید و مایه\u200Cی شگفتی ناظران جهانی شد و در برخی از رشته\u200Cهای حسّاس و نوپدید به رتبه\u200Cهای نخستین ارتقاء داد، همه\u200Cوهمه در حالی اتّفاق افتاده که کشور دچار تحریم مالی و تحریم علمی بوده است. ما با وجود شنا در جهت مخالف جریان دشمن\u200Cساز، به رکوردهای بزرگ دست یافته\u200Cایم و این نعمت بزرگی است که به\u200Cخاطر آن باید روز و شب خدا را سپاس گفت.\n" +
                "\n" +
                "امّا آنچه من میخواهم بگویم این است که این راه طی\u200Cشده، با همه\u200Cی اهمّیّتش فقط یک آغاز بوده است و نه بیشتر. ما هنوز از قلّه\u200Cهای دانش جهان بسیار عقبیم؛ باید به قلّه\u200Cها دست یابیم. باید از مرزهای کنونی دانش در مهم\u200Cترین رشته\u200Cها عبور کنیم. ما از این مرحله هنوز بسیار عقبیم؛ ما از صفر شروع کرده\u200Cایم. عقب\u200Cماندگی شرم\u200Cآور علمی در دوران پهلوی\u200Cها و قاجارها در هنگامی که مسابقه\u200Cی علمی دنیا تازه شروع شده بود، ضربه\u200Cی سختی بر ما وارد کرده و ما را از این کاروان شتابان، فرسنگها عقب نگه داشته بود. ما اکنون حرکت را \u200Cآغاز کرده و با شتاب پیش میرویم ولی این شتاب باید سالها با شدّت بالا ادامه یابد تا آن عقب\u200Cافتادگی جبران شود. اینجانب همواره به دانشگاه\u200Cها و دانشگاهیان و مراکز پژوهش و پژوهندگان، گرم و قاطع و جدّی دراین\u200Cباره تذکّر و هشدار و فراخوان داده\u200Cام، ولی اینک مطالبه\u200Cی عمومی من از شما جوانان آن است که این راه را با احساس مسئولیّت بیشتر و همچون یک جهاد در پیش گیرید. سنگ بنای یک انقلاب علمی در کشور گذاشته شده و این انقلاب، شهیدانی از قبیل شهدای هسته\u200Cای نیز داده است. به\u200Cپاخیزید و دشمن بدخواه و کینه\u200Cتوز را که از جهاد علمی شما بشدّت بیمناک است ناکام سازید.\n" +
                "\n" +
                "دو) معنویّت و اخلاق\n" +
                "۲) معنویّت و اخلاق: معنویّت به معنی برجسته کردن ارزشهای معنوی از قبیل: اخلاص، ایثار، توکّل، ایمان در خود و در جامعه است، و اخلاق به معنی رعایت فضیلت\u200Cهایی چون خیرخواهی، گذشت، کمک به نیازمند، راستگویی، شجاعت، تواضع، اعتمادبه\u200Cنفس و دیگر خلقیّات نیکو است. معنویّت و اخلاق، جهت\u200Cدهنده\u200Cی همه\u200Cی حرکتها و فعّالیّتهای فردی و اجتماعی و نیاز اصلی جامعه است؛ بودن آنها، محیط زندگی را حتّی با کمبودهای مادّی، بهشت میسازد و نبودن آن حتّی با برخورداری مادّی، جهنّم می\u200Cآفریند.\n" +
                "\n" +
                "شعور معنوی و وجدان اخلاقی در جامعه هرچه بیشتر رشد کند برکات بیشتری به بار می\u200Cآورد؛ این، بی\u200Cگمان محتاج جهاد و تلاش است و این تلاش و جهاد، بدون همراهی حکومتها توفیق چندانی نخواهد یافت. اخلاق و معنویّت، البتّه با دستور و فرمان به دست نمی\u200Cآید، پس حکومتها نمیتوانند آن را با قدرت قاهره ایجاد کنند، امّا اوّلاً خود باید منش و رفتار اخلاقی و معنوی داشته باشند، و ثانیاً زمینه\u200C را برای رواج آن در جامعه فراهم کنند و به نهادهای اجتماعی دراین\u200Cباره میدان دهند و کمک برسانند؛ با کانونهای ضدّ معنویّت و اخلاق، به شیوه\u200Cی معقول بستیزند و خلاصه اجازه ندهند که جهنّمی\u200Cها مردم را با زور و فریب، جهنّمی کنند.\n" +
                "\n" +
                "ابزارهای رسانه\u200Cای پیشرفته و فراگیر، امکان بسیار خطرناکی در اختیار کانونهای ضدّ معنویّت و ضدّ اخلاق نهاده است و هم\u200Cاکنون تهاجم روزافزون دشمنان به دلهای پاک جوانان و نوجوانان و حتّی نونهالان با بهره\u200Cگیری از این ابزارها را به چشم خود می\u200Cبینیم. دستگاه\u200Cهای مسئول حکومتی دراین\u200Cباره وظایفی سنگین بر عهده دارند که باید هوشمندانه و کاملاً مسئولانه صورت گیرد. و این البتّه به معنی رفع مسئولیّت از اشخاص و نهادهای غیرحکومتی نیست. در دوره\u200Cی پیش\u200Cِرو باید دراین\u200Cباره\u200Cها برنامه\u200Cهای کوتاه\u200Cمدّت و میان\u200Cمدّت جامعی تنظیم و اجرا شود؛ ان\u200Cشاء\u200Cالله.\n" +
                "\n" +
                "سه) اقتصاد\n" +
                "۳) اقتصاد: اقتصاد یک نقطه\u200Cی کلیدیِ تعیین\u200Cکننده است. اقتصاد قوی، نقطه\u200Cی قوّت و عامل مهمّ سلطه\u200Cناپذیری و نفوذناپذیری کشور است و اقتصاد ضعیف، نقطه\u200Cی ضعف و زمینه\u200C\u200Cساز نفوذ و سلطه و دخالت دشمنان است. فقر و غنا در مادّیّات و معنویّات بشر، اثر میگذارد. اقتصاد البتّه هدف جامعه\u200Cی اسلامی نیست، امّا وسیله\u200Cای است که بدون آن نمیتوان به هدفها رسید. تأکید بر تقویت اقتصاد مستقلّ کشور که مبتنی\u200C بر تولید انبوه و باکیفیّت، و توزیع عدالت\u200Cمحور، و مصرف به\u200Cاندازه و بی\u200Cاسراف، و مناسبات مدیریّتی خردمندانه است و در سالهای اخیر از سوی اینجانب بارها تکرار و بر آن تأکید شده، به\u200Cخاطر همین تأثیر شگرفی است که اقتصاد میتواند بر زندگی امروز و فردای جامعه بگذارد.\n" +
                "\n" +
                "انقلاب اسلامی راه نجات از اقتصاد ضعیف و وابسته و فاسد دوران طاغوت را به ما نشان داد، ولی عملکردهای ضعیف، اقتصاد کشور را از بیرون و درون دچار چالش ساخته است. چالش بیرونی تحریم و وسوسه\u200Cها\u200Cی دشمن است که در صورت اصلاح مشکل درونی، کم\u200Cاثر و حتّی بی\u200Cاثر خواهد شد. چالش درونی عبارت از عیوب ساختاری و ضعفهای مدیریّتی است.\n" +
                "\n" +
                "مهم\u200Cترین عیوب، وابستگی اقتصاد به نفت، دولتی بودن بخشهایی از اقتصاد که در حیطه\u200Cی وظایف دولت نیست، نگاه به خارج و نه به توان و ظرفیّت داخلی، استفاده\u200Cی اندک از ظرفیّت نیروی انسانی کشور، بودجه\u200Cبندی معیوب و نامتوازن، و سرانجام عدم ثبات سیاستهای اجرائی اقتصاد و عدم رعایت اولویّتها و وجود هزینه\u200Cهای زائد و حتّی مسرفانه در بخشهایی از دستگاه\u200Cهای حکومتی است. نتیجه\u200Cی اینها مشکلات زندگی مردم از قبیل بیکاری جوانها، فقر درآمدی در طبقه\u200Cی ضعیف و امثال آن است.\n" +
                "\n" +
                "راه\u200Cحلّ این مشکلات، سیاستهای اقتصاد مقاومتی است که باید برنامه\u200Cهای اجرائی برای همه\u200Cی بخشهای آن تهیّه و با قدرت و نشاط کاری و احساس مسئولیّت، در دولتها پیگیری و اقدام شود. درون\u200Cزایی اقتصاد کشور، مولّد شدن و دانش\u200Cبنیان شدن آن، مردمی کردن اقتصاد و تصدّیگری نکردن دولت، برون\u200Cگرایی با استفاده از ظرفیّتهایی که قبلاً به آن اشاره شد، بخشهای مهمّ این راه\u200Cحل\u200Cها است. بی\u200Cگمان یک مجموعه\u200Cی جوان و دانا و مؤمن و مسلّط بر دانسته\u200Cهای اقتصادی در درون دولت خواهند توانست به این مقاصد برسند. دوران پیشِ\u200Cرو باید میدان فعّالیّت چنین مجموعه\u200Cای باشد.\n" +
                "\n" +
                "جوانان عزیز در سراسر کشور بدانند که همه\u200Cی راه\u200Cحل\u200Cها در داخل کشور است. اینکه کسی گمان کند که «مشکلات اقتصادی صرفاً ناشی از تحریم است و علّت تحریم هم مقاومت ضدّ استکباری و تسلیم نشدن در برابر دشمن است؛ پس راه\u200Cحل، زانو زدن در برابر دشمن و بوسه زدن بر پنجه\u200Cی گرگ است» خطایی نابخشودنی است. این تحلیل سراپا غلط، هرچند گاه از زبان و قلم برخی غفلت\u200Cزدگان داخلی صادر میشود، امّا منشأ آن، کانونهای فکر و توطئه\u200Cی خارجی است که با صد زبان به تصمیم\u200Cسازان و تصمیم\u200Cگیران و افکار عمومی داخلی القاء میشود.\n" +
                "\n" +
                "چهار) عدالت و مبارزه با فساد\n" +
                "۴) عدالت و مبارزه با فساد: این دو لازم و ملزوم یکدیگرند. فساد اقتصادی و اخلاقی و سیاسی، توده\u200Cی چرکین کشورها و نظامها و اگر در بدنه\u200Cی حکومتها عارض شود، زلزله\u200Cی ویرانگر و ضربه\u200Cزننده به مشروعیّت آنها است؛ و این برای نظامی چون جمهوری اسلامی که نیازمند مشروعیّتی فراتر از مشروعیّتهای مرسوم و مبنائی\u200Cتر از مقبولیّت اجتماعی است، بسیار جدّی\u200Cتر و بنیانی\u200Cتر از دیگر نظامها است. وسوسه\u200Cی مال و مقام و ریاست، حتّی در عَلَوی\u200Cترین حکومت تاریخ یعنی حکومت خود حضرت امیر\u200C\u200Cالمؤمنین (علیه\u200Cالسّلام) کسانی را لغزاند، پس خطر بُروز این تهدید در جمهوری اسلامی هم که روزی مدیران و مسئولانش مسابقه\u200Cی زهد انقلابی و ساده\u200Cزیستی میدادند، هرگز بعید نبوده و نیست؛ و این ایجاب میکند که دستگاهی کارآمد با نگاهی تیزبین و رفتاری قاطع در قوای سه\u200Cگانه حضور دائم داشته باشد و به\u200Cمعنای واقعی با فساد مبارزه کند، بویژه در درون دستگاه\u200Cهای حکومتی.\n" +
                "\n" +
                "البتّه نسبت فساد در میان کارگزاران حکومت جمهوری اسلامی در مقایسه با بسیاری از کشورهای دیگر و بخصوص با رژیم طاغوت که سرتاپا فساد و فسادپرور بود، بسی کمتر است و بحمدالله مأموران این نظام غالباً سلامت خود را نگاه داشته\u200Cاند، ولی حتّی آنچه هست غیر قابل قبول است. همه باید بدانند که طهارت اقتصادی شرط مشروعیّت همه\u200Cی مقامات حکومت جمهوری اسلامی است. همه باید از شیطانِ حرص برحذر باشند و از لقمه\u200Cی حرام بگریزند و از خداوند دراین\u200Cباره کمک بخواهند و دستگاه\u200Cهای نظارتی و دولتی باید با قاطعیّت و حسّاسیّت، از تشکیل نطفه\u200Cی فساد پیشگیری و با رشد آن مبارزه کنند. این مبارزه نیازمند انسانهایی باایمان و جهادگر، و منیع\u200Cالطّبع با دستانی پاک و دلهایی نورانی است. این مبارزه بخش اثرگذاری است از تلاش همه\u200Cجانبه\u200Cای که نظام جمهوری اسلامی باید در راه استقرار عدالت به کار برد.\n" +
                "\n" +
                "عدالت در صدر هدفهای اوّلیّه\u200Cی همه\u200C\u200Cی بعثتهای الهی است و در جمهوری اسلامی نیز دارای همان شأن و جایگاه است؛ این، کلمه\u200Cای مقدّس در همه\u200Cی زمانها و سرزمین\u200Cها است و به\u200Cصورت کامل، جز در حکومت حضرت ولیّ\u200Cعصر (ارواحنافداه) میسّر نخواهد شد ولی به\u200Cصورت نسبی، همه جا و همه وقت ممکن و فریضه\u200Cای بر عهده\u200Cی همه بویژه حاکمان و قدرتمندان است. جمهوری اسلامی ایران در این راه گامهای بلندی برداشته است که قبلاً بدان اشاره\u200Cای کوتاه رفت؛ و البتّه در توضیح و تشریح آن باید کارهای بیشتری صورت گیرد و توطئه\u200Cی واژگونه\u200Cنمایی و لااقل سکوت و پنهان\u200Cسازی که اکنون برنامه\u200Cی جدّی دشمنان انقلاب است، خنثی گردد.\n" +
                "\n" +
                "با این همه، اینجانب به جوانان عزیزی که آینده\u200Cی کشور، چشم\u200Cانتظار آنها است صریحاً میگویم آنچه تاکنون شده با آنچه باید میشده و بشود، دارای فاصله\u200C\u200Cای ژرف است. در جمهوری اسلامی، دلهای مسئولان به\u200Cطور دائم باید برای رفع محرومیّتها بتپد و از شکافهای عمیق طبقاتی بشدّت بیمناک باشد. در جمهوری اسلامی کسب ثروت نه\u200Cتنها جرم نیست که مورد تشویق نیز هست، امّا تبعیض در توزیع منابع عمومی و میدان دادن به ویژه\u200Cخواری و مدارا با فریبگران اقتصادی که همه به بی\u200Cعدالتی می\u200Cانجامد، بشدّت ممنوع است؛ همچنین غفلت از قشرهای نیازمند حمایت، به\u200Cهیچ\u200Cرو مورد قبول نیست. این سخنان در قالب سیاستها و قوانین، بارها تکرار شده است ولی برای اجرای شایسته\u200Cی آن، چشم امید به شما جوانها است؛ و اگر زمام اداره\u200Cی بخشهای گوناگون کشور به جوانان مؤمن و انقلابی و دانا و کاردان -که بحمدالله کم نیستند- سپرده شود، این امید برآورده خواهد شد؛ ان\u200Cشاءالله.\n" +
                "\n" +
                "پنج) استقلال و آزادی\n" +
                "۵) استقلال و آزادی: استقلال ملّی به معنی آزادی ملّت و حکومت از تحمیل و زورگویی قدرتهای سلطه\u200Cگر جهان است. و آزادی اجتماعی به\u200Cمعنای حقّ تصمیم\u200Cگیری و عمل کردن و اندیشیدن برای همه\u200Cی افراد جامعه است؛ و این هر دو از جمله\u200Cی ارزشهای اسلامی\u200Cاند و این هر دو عطیّه\u200Cی الهی به انسانها\u200Cیند و هیچ کدام تفضّل حکومتها به مردم نیستند. حکومتها موظّف به تأمین این دو اند. منزلت آزادی و استقلال را کسانی بیشتر میدانند که برای آن جنگیده\u200Cاند. ملّت ایران با جهاد چهل\u200Cساله\u200Cی خود از جمله\u200Cی آنها است. استقلال و آزادی کنونی ایران اسلامی، دستاورد، بلکه خون\u200Cآوردِ صدها هزار انسان والا و شجاع و فداکار است؛ غالباً جوان، ولی همه در رتبه\u200Cهای رفیع انسانیّت. این ثمر شجره\u200Cی طیّبه\u200Cی انقلاب را با تأویل و توجیه\u200Cهای ساده\u200Cلوحانه و بعضاً مغرضانه، نمیتوان در خطر قرار داد. همه -مخصوصاً دولت جمهوری اسلامی\u200C- موظّف به حراست از آن با همه\u200Cی وجودند. بدیهی است که «استقلال» نباید به معنی زندانی کردن سیاست و اقتصاد کشور در میان مرزهای خود، و «آزادی» نباید در تقابل با اخلاق و قانون و ارزشهای الهی و حقوق عمومی تعریف شود.\n" +
                "\n" +
                "شش) عزت ملی، روابط خارجی، مرزبندی با دشمن\n" +
                "۶) عزّت ملّی، روابط خارجی، مرزبندی با دشمن: این هر سه، شاخه\u200Cهایی از اصلِ «عزّت، حکمت، و مصلحت» در روابط بین\u200Cالمللی\u200Cاند. صحنه\u200Cی جهانی، امروز شاهد پدیده\u200Cهایی است که تحقّق یافته یا در آستانه\u200C\u200Cی ظهورند: تحرّک جدید نهضت بیداری اسلامی بر اساس الگوی مقاومت در برابر سلطه\u200Cی آمریکا و صهیونیسم؛ شکست سیاست\u200Cهای آمریکا در منطقه\u200Cی غرب آسیا و زمین\u200Cگیر شدن همکاران خائن آنها در منطقه؛ گسترش حضور قدرتمندانه\u200Cی سیاسی جمهوری اسلامی در غرب آسیا و بازتاب وسیع آن در سراسر جهان سلطه.\n" +
                "\n" +
                "اینها بخشی از مظاهر عزّت جمهوری اسلامی است که جز با شجاعت و حکمت مدیران جهادی به دست نمی\u200Cآمد. سردمداران نظام سلطه نگرانند؛ پیشنهادهای آنها عموماً شامل فریب و خدعه و دروغ است. امروز ملّت ایران علاوه\u200C بر آمریکای جنایت\u200Cکار، تعدادی از دولتهای اروپایی را نیز خدعه\u200Cگر و غیر قابل اعتماد میداند. دولت جمهوری اسلامی باید مرزبندی خود را با آنها با دقّت حفظ کند؛ از ارزشهای انقلابی و ملّی خود، یک گام هم عقب\u200Cنشینی نکند؛ از تهدیدهای پوچ آنان نهراسد؛ و در همه\u200Cحال، عزّت کشور و ملّت خود را در نظر داشته باشد و حکیمانه و مصلحت\u200Cجویانه و البتّه از موضع انقلابی، مشکلات قابل حلّ خود را با آنان حل کند. در مورد آمریکا حلّ هیچ مشکلی متصوّر نیست و مذاکره با آن جز زیان مادّی و معنوی محصولی نخواهد داشت.\n" +
                "\n" +
                "هفت) سبک زندگی\n" +
                "۷) سبک زندگی: سخن لازم دراین\u200Cباره بسیار است. آن را به فرصتی دیگر وامیگذارم و به همین جمله اکتفا میکنم که تلاش غرب در ترویج سبک زندگی غربی در ایران، زیانهای بی\u200Cجبران اخلاقی و اقتصادی و دینی و سیاسی به کشور و ملّت ما زده است؛ مقابله با آن، جهادی همه\u200Cجانبه و هوشمندانه میطلبد که باز چشم امید در آن به شما جوانها است.\n" +
                "\n" +
                "در پایان از حضور سرافرازانه و افتخارانگیز و دشمن\u200Cشکن ملّت عزیز در بیست\u200Cودوّم بهمن و چهلمین سالگرد انقلاب عظیم اسلامی تشکّر میکنم و پیشانی سپاس بر درگاه حضرت حق میسایم. سلام بر حضرت بقیّة\u200Cالله (ارواحنافداه)؛ سلام بر ارواح طیّبه\u200Cی شهیدان والامقام و روح مطهّر امام بزرگوار؛ و سلام بر همه\u200Cی ملّت عزیز ایران و سلام ویژه به جوانان." +
                "");
    }

    private void data2() {
        txt_detail.setText("" +
                "مقام معظم رهبری در تعریف ولایت فقیه می نویسند: «ولایت فقیه به معناى حاكمیّت مجتهد جامع\u200Cالشرایط در عصر غیبت است و شعبه\u200Cاى است از ولایت ائمه\u200Cى اطهار (علیهم السلام) كه همان ولایت رسول الله (صلى الله علیه و آله و سلم) مى\u200Cباشد.»[resane] بنابر این تعریف، ولایت فقیه از جنس حاکمیت است حاکمیتی که آن را مجتهدی جامع الشرایط بر عهده دارد." +
                "\n" +
                "مجتهد جامع الشرایط کیست؟\n" +
                "\n" +
                "مجتهد به کسی می گویند که توان استنباط احکام الهی را از منابع اصلی دین؛ یعنی قرآن و روایات داراست و مراد از جامع الشرایط مجتهدی است که فراتر از دانش فقه و توان استنباط دارای شرایط زیر باشد:\n" +
                "\n" +
                "«اجتهاد مطلق»، «عدالت مطلق»، و «قدرت مدیریت و استعداد رهبری». یعنی از سویی باید صدر و ساقه ی اسلام را به طور عمیق و با استدلال و استنباط بشناسد و از سوی دیگر، در تمام زمینه ها، حدود و ضوابط الهی را رعایت كند و از هیچ یك تخطّی و تخلّف ننماید و از سوی سوّم، استعداد و توانایی مدیریت و كشورداری و لوازم آن را دارا باشد.[2] بنابراین کسی می تواند مسوولیت ولایت و مدیریت جامعه ی اسلامی را بپذیرد و از عهده ی آن برآید که مجتهد مطلق، عادل مطلق و دارای توان مدیریت و رهبری باشد. \n" +
                "\n" +
                " \n" +
                "توضیح این سه عنوان\n" +
                "\n" +
                "مجتهد مطلق، مجتهد مطلق اسلام شناسی است که در همه ی اصول و فروع دین، مجتهد باشد؛ دینی که دیانت آن، عین سیاست است و سیاست آن، عین دیانتش می باشد.\n" +
                "\n" +
                "كسی كه در تحلیل همه ی معارف دین، اجتهاد مطلق ندارد و به اصطلاح، «مجتهد متجزی» است، صلاحیت ولایت بر جامعه اسلامی و اداره ی آن را ندارد و همچنین فقیهی كه ابعاد سیاسی اسلام را خوب نفهمیده است، توان چنین مسوولیت عظیمی را نمی تواند داشته باشد؛ زیرا کسی که برخی از مسایل اسلامی برای خودش حل نشده و خود نمی تواند آنها را عمیقاً بررسی نماید؛ نه می تواند فتوا بدهد و نه می تواند اسلام را به اجرا درآورد و بر مسند ولایت و رهبری جامعه اسلامی تکیه زند.\n" +
                "\n" +
                "بنابراین ولی فقیه باید کسی باشد که ضمن آشنایی و تسلط کامل به اصول و فروع دین، بتواند مسایل جدید مسلمانان را با درایتی عاقلانه و با استفاده از منابع اصلی دین (قرآن و روایات) حل كند." +
                "\n" +
                "عادل مطلق\n" +
                "\n" +
                "اسلام شناسی که می خواهد ولایت و رهبری جامعه اسلامی را عهده دار شود علاوه بر این كه لازم است علم دین را درست بفهمد، باید آن علم را در خودش و در جامعه ی اسلامی نیز به درستی اجرا نماید. برای همین لازم است همه وظایف دینی خود را انجام داده و آن چه از دین باید به مردم ابلاغ كند، ابلاغ نموده و چیزی را كتمان نكند. فقیه عادل، نباید کاری را بر اساس میل و هوس انجام دهد؛ مطیع هواهای نفسانی نگردد و گناهی از او سر نزند؛ نه واجبی را ترك كند و نه حرامی را مرتكب شود. برای همین شخصی كه مطیع هوس است هیچ گاه صلاحیت ولایت و هدایت جامعه اسلامی را ندارد. \n" +
                "\n" +
                "بنابراین، ویژگی دوم رهبر جامعه اسلامی، ترك هوا و هوس و تابعیت عملی محض نسبت به احكام و دستورهای دین است. فقیه حاكم، اگر فتوا می دهد، باید خود نیز به آن عمل كند و اگر حكم قضایی صادر می كند، خود نیز آن را بپذیرد و اگر حكم ولایی و حكومتی صادر می نماید، خود نیز به آن گردن نهد و آن را نقض نكند.\n" +
                "\n" +
                " \n" +
                "توان مدیریت و رهبری جامعه\n" +
                "\n" +
                "رهبر جامعه اسلامی علاوه بر اجتهاد و عدالت مطلق، باید هم بینش درست و صحیحی نسبت به امور سیاسی و اجتماعی داخل و خارج كشور داشته باشد و ترفندهای دشمنان را خوب بشناسد و هم از هنر مدیریت و لوازم آن برخوردار باشد؛ زیرا مدیریّت، گذشته از تئوری، نیازمند ذوق اداره و هنر تدبیر است. هنر اداره و تدبیر، غیر از دانش و بینش سیاسی است؛ هنری است كه هر كس آن را ندارد.[3]\n" +
                "\n" +
                "برای همین در اصل یكصد و نهم قانون اساسی جمهوری اسلامی ایران، در بیان شرایط و صفات رهبری، آمده است:\n" +
                "\n" +
                "resane- صلاحیت علمی لازم برای افتاء در ابواب مختلف فقه.\n" +
                "\n" +
                "2- عدالت و تقوای لازم برای رهبری امت اسلام.\n" +
                "\n" +
                "3- بینش صحیح سیاسی و اجتماعی، تدبیر، شجاعت ، مدیریّت و قدرت كافی برای رهبری.\n" +
                "\n" +
                "و نیز آمده است: در صورت تعدّد واجدین شرایط فوق، شخصی كه دارای بینش فقهی و سیاسی قوی تر باشد مقدّم است.\n" +
                "\n" +
                " \n" +
                "ولایت فقیه در عصر غیبت\n" +
                "\n" +
                "بنابر تعریفی که مقام معظم رهبری از ولایت فقیه ارائه می دهند این ولایت و حاکمیت را مخصوص دوران غیبت دانسته و آن را شعبه ای از ولایت ائمه\u200Cى اطهار (علیهم السلام) كه همان ولایت رسول الله (صلى الله علیه و آله و سلم) می دانند. این بدان معناست که حاکمیتی را که مجتهد جامع الشرایط در عصر غیبت عهده دار است و از آن به ولایت فقیه تعبیر می شود چیزی جدای از حکومت رسول خدا (صلی الله علیه و آله) و امامان معصوم(علیهم السلام) بر جامعه اسلامی در عصر خودشان نیست و با همان ساز و کار و به سوی همان هدف است؛ هدفی که جز پیاده کردن احکام اسلامی و ایجاد زمینه ای مناسب برای بندگی خدا نیست.\n" +
                "\n" +
                "با این تفاوت كه احكام مربوط به ولایت فقیه مانند سایر احكام فقهى از ادله شرعى استنباط مى\u200Cشوند[4] ولی احکام صادره از سوی حضرات معصومین(علیهم السلام) به شکل مستقیم و یا به واسطه معصوم پیشین از وحی گرفته می شد. " +
                "\n" +
                "ولایت فقیه، حکم شرعی تعبدی است\n" +
                "\n" +
                "مقام معظم رهبری ولایت فقیه را حکم شرعی تعبدی دانسته که مورد تأیید عقل نیز می باشد[5] ؛ یعنی نه تنها نصوص دینی ما را به برپایی چنین نظامی توصیه می کند؛ بلکه عقل نیز به تنهایی وجود چنین نظامی را برای جامعه اسلامی و رهبری مسلمانان مورد تأیید قرار می دهد.\n" +
                "\n" +
                " \n" +
                "شیوه ی تعیین ولی فقیه\n" +
                "\n" +
                "مقام معظم رهبری درباره شیوه ی تعیین شخصی که باید عهده دار این مسند شود می نویسد:\n" +
                "\n" +
                "«در تعیین مصداق آن روش عقلائى وجود دارد كه در قانون اساسى جمهورى اسلامى ایران بیان شده است.»[6] که مراد تشکیل مجلس خبرگان رهبری با رأی مردم و بعد تعیین ولی فقیه با توجه به شرایط فقهی قانونی از سوی این خبرگان است.\n" +
                "\n" +
                " \n" +
                "نتیجه اینکه\n" +
                "\n" +
                "بر اساس تعریف مقام معظم رهبری، ولایت فقیه یعنی حاکمیت فقیهی عادل و توانا در مدیریت بر جامعه اسلامی برای اداره آن بر اساس موازین اسلامی. که این شیوه ی حاکمیت مخصوص عصر غیبت است و نصوص دینی ما را بر تشکیل چنین حکومتی دستور می دهند؛ شیوه ای که عقل سلیم نیز بر آن اعتراف داشته و آن را تأیید می کند.  " +
                "\n" +
                "پی نوشت:\n" +
                "\n" +
                "resane. پایگاه دفتر مقام معظم رهبری، پرسشهای متداول\n" +
                "\n" +
                "2. ولایت فقیه (ولایت فقاهت و عدالت)، آیت الله جوادی آملی، ص 136 3. ر. ک به همان صص 136 تا 140 4. اجوبة الاستفتائات، سوال 67 5. همان، سوال 56 6. همان " +
                "");
    }

    private void data1() {
        txt_detail.setText("" +
                "رهبر عالیقدر حضرت آیت\u200Cالله سید علی خامنه\u200Cای فرزند مرحوم حجت الاسلام والمسلمین حاج سید جواد حسینی خامنه\u200Cای، ۲۴ تیرماه ۱۳۱۸ برابر با ۲۸ صفر ۱۳۵۸ قمری در مشهد مقدس چشم به دنیا گشود." +
                "\n" +
                "ایشان دومین پسر خانواده هستند. زندگی سید جواد خامنه\u200Cای مانند بیشتر روحانیون و مدرسّان علوم دینی، بسیار ساده بود. همسر و فرزندانش نیز معنای عمیق قناعت و ساده زیستی را از او یاد گرفته بودند و با آن خو داشتند.\n" +
                "\n" +
                "رهبر بزرگوار در ضمن بیان نخستین خاطره های زندگی خود از وضع و حال زندگی خانواده شان چنین می گویند: «پدرم روحانی معروفی بود، امّا خیلی پارسا و گوشه گیر... زندگی ما به سختی می گذشت. من یادم هست شب هایی اتفاق می افتاد که در منزل ما شام نبود! مادرم با زحمت برای ما شام تهیّه می کرد و... آن شام هم نان و کشمش بود.\n" +
                "\n" +
                "امّا خانه\u200Cای را که خانواده سیّد جواد در آن زندگی می\u200Cکردند، رهبر انقلاب چنین توصیف می\u200Cکنند: «منزل پدری من که در آن متولد شده ام، تا چهارـ پنج سالگی من، یک خانه ۶۰ ـ ۷۰ متری در محّله فقیر نشین مشهد بود که فقط یک اتاق داشت و یک زیر زمین تاریک و خفه\u200Cای! هنگامی که برای پدرم میهمان می\u200Cآمد (و معمولاً پدر بنا بر این که روحانی و محل مراجعه مردم بود، میهمان داشت) همه ما باید به زیر زمین می\u200Cرفتیم تا مهمان برود. بعد عدّه\u200Cای که به پدر ارادتی داشتند، زمین کوچکی را کنار این منزل خریده به آن اضافه کردند و ما دارای سه اتاق شدیم.»\n" +
                "\n" +
                "رهبرانقلاب از دوران کودکی در خانواده\u200Cای فقیر امّا روحانی و روحانی پرور و پاک و صمیمی، اینگونه پرورش یافت و از چهار سالگی به همراه برادر بزرگش سید محمد به مکتب سپرده شد تا الفبا و قرآن را یاد بگیرند. سپس، دو برادر را در مدرسه تازه تأسیس اسلامی «دارالتعّلیم دیانتی» ثبت نام کردند و این دو دوران تحصیل ابتدایی را در آن مدرسه گذراندند." +
                "\n" +
                "    در حوزه علمیه\n" +
                "\n" +
                "ایشان از دوره دبیرستان، خواندن «جامع المقدمات» و صرف و نحو را آغاز کرده بود. سپس از مدرسه جدید وارد حوزه علمیه شد و نزد پدر و دیگر اساتید وقت ادبیات و مقدمات را خواند.\n" +
                "درباره انگیزه ورود به حوزه علمیه و انتخاب راه روحانیت می گویند:  «عامل و موجب اصلی در انتخاب این راه نورانی روحانیت پدرم بودند و مادرم نیز علاقه مند و مشوّق بودند».\n" +
                "\n" +
                "ایشان کتب ادبی ار قبیل «جامع المقدمات»، «سیوطی»، «مغنی» را نزد مدرّسان مدرسه «سلیمان خان» و «نوّاب» خواند و پدرش نیز بر درس فرزندانش نظارت می کرد. کتاب «معالم» را نیز در همان دوره خواند.\n" +
                "\n" +
                "سپس «شرایع الاسلام» و «شرح لمعه» را در محضر پدرش و مقداری را نزد مرحوم «آقا میرزا مدرس یزدی» و رسائل و مکاسب را در حضور مرحوم حاج شیخ هاشم قزوینی و بقیه دروس سطح فقه و اصول را نزد پدرش خواند و دوره مقدمات و سطح را بطور کم سابقه و شگفت انگیزی در پنچ سال و نیم به اتمام رساند." +
                "پدرش مرحوم سید جواد در تمام این مراحل نقش مهّمی در پیشرفت این فرزند برومند داشت. رهبر بزرگوار انقلاب، در زمینه منطق و فلسفه، کتاب منظومه سبزوار را ابتدا از «مرحوم آیت الله میرزا جواد آقا تهرانی» و بعدها نزد مرحوم «شیخ رضا ایسی» خواندند.\n" +
                "\n" +
                "    در حوزه علمیه نجف اشرف\n" +
                "\n" +
                "آیت الله خامنه ای که از هیجده سالگی در مشهد درس خارج فقه و اصول را نزد مرجع بزرگ مرحوم آیت الله العظمی میلانی شروع کرده بودند. در سال ۱۳۳۶ به قصد زیارت عتبات عالیات، عازم نجف اشرف شدند و با مشاهده و شرکت در درسهای خارج مجتهدان بزرگ حوزه نجف از جمله مرحوم سید محسن حکیم، سید محمود شاهرودی، میرزا باقر زنجانی، سید یحیی یزدی، و میرزا حسن بجنوردی، اوضاع درس و تدریس و تحقیق آن حوزه علمیه را پسندیدند و ایشان را از قصد خود آگاه ساختند. ولی پدر موافقت نکرد. پس از مدّ تی ایشان به مشهد باز گشتند.\n" +
                "\n" +
                "    در حوزه علمیه قم\n" +
                "\n" +
                "آیت الله خامنه\u200Cای از سال ۱۳۳۷ تا ۱۳۴۳ در حوزه علمیه قم به تحصیلات عالی در فقه و اصول و فلسفه، مشغول شدند و از محضر بزرگان چون مرحوم آیت الله العظمی بروجردی، امام خمینی، شیخ مرتضی حائری یزدی وعلـّامه طباطبائی استفاده کردند.\n" +
                "\n" +
                "در سال ۱۳۴۳، از مکاتباتی که رهبر انقلاب با پدرشان داشتند، متوجّه شدند که یک چشم پدر به علت «آب مروارید» نابینا شده است، بسیار غمگین شدند و بین ماندن در قم و ادامه تحصیل در حوزه عظیم آن و رفتن به مشهد و مواظبت از پدر در تردید ماندند.\n" +
                "\n" +
                "آیت الله خامنه ای به این نتیجـه رسیدند که به خاطر خدا از قــم به مشهد هجرت کنند واز پدرشان مواظبت نمایند. ایشان در این مـورد می گویند: «به مشهد رفتم و خدای متعال توفیقات زیادی به ما داد. به هر حال به دنبال کار و وظیفه خود رفتم. اگر بنده در زندگی توفیقی داشتم، اعتقادم این است که ناشی از همان بّری «نیکی» است که به پدر، بلکه به پدر و مادر انجام داده ام».\n" +
                "\n" +
                "آیت الله خامنه ای بر سر این دو راهی، راه درست را انتخاب کردند. بعضی از اساتید و آشنایان افسوس می خوردند که چرا ایشان به این زودی حوزه علمیه قم را ترک کردند، اگر می ماندند در آینده چنین و چنان می شدند!... امّا آینده نشان داد که انتخاب ایشان درست بوده و دست تقدیر الهی برای ایشان سر نوشتی دیگر و بهتر و والاتر از محاسبات آنان، رقم زده بود.\n" +
                "\n" +
                "آیا کسی تصّور می\u200Cکرد که در آن روز جوان عالم پراستعداد ۲۵ ساله، که برای رضای خداوند و خدمت به پدر و مادرش از قم به مشهد می رفت، ۲۵ سال بعد، به مقام والای ولایت امر مسلمین خواهد رسید؟! ایشان در مشهد از ادامه درس دست برنداشتند و جز ایام تعطیل یا مبازره و زندان و مسافرت، به طور رسمی تحصیلات فقهی و اصول خود را تا سال ۱۳۴۷ در محضر اساتید بزرگ حوزه مشهد بویژه آیت الله میلانی ادامه دادند.\n" +
                "\n" +
                "همچنین ازسال ۱۳۴۳ که در مشهد ماندگار شدند در کنار تحصیل و مراقبت از پدر پیر و بیمار، به تدریس کتب فقه و اصول و معارف دینی به طلـّاب جوان و دانشجویان نیز می پرداختند.\n" +
                "\n" +
                "    مبارزات سیاسی\n" +
                "\n" +
                "آیت الله خامنه ای به گفته خویش «از شاگردان فقهی، اصولی، سیاسی و انقلابی امام خمینی (ره) هستند» امـّا نخستین جرقـّه های سیاسی و مبارزاتی و دشمنی با طاغوت را مجاهد بزرگ و شهید راه اسلام شهید «سید مجتبی نوّاب صفوی» در ذهن ایشان زده است، هنگامیکه نوّاب صفوی با عدّه ای از فدائیان اسلام در سال ۳۱ به مشهد رفته در مدرسه سلیمان خان، سخنرانی پر هیجان و بیدار کننده ای در موضوع احیای اسلام و حاکمیت احکام الهی، و فریب و نیرنگ شاه و انگلیسی و دروغگویی آنان به ملـّت ایران، ایراد کردند.\n" +
                "\n" +
                "آیت الله خامنه\u200Cای آن روز از طـّلاب جوان مدرسه سلیمان خان بودند، به شدّت تحت تأثیر سخنان آتشین نوّاب واقع شدند. ایشان می گویند: «همان وقت جرقه های انگیزش انقلاب اسلامی به وسیله نوّاب صفوی در من به وجود آمده و هیچ شکی ندارم که اولین آتش را مرحوم نوّاب در دل ما روشن کرد».\n" +
                "\n" +
                "    همراه با نهضت امام خمینی (قدس سره)\n" +
                "\n" +
                "آیت الله خامنه\u200Cای از سال ۱۳۴۱ که در قم حضور داشتند و حرکت انقلابی واعتراض آمیز امام خمینی علیه سیاستهای ضد اسلامی و آمریکا پسند محمد رضا شاه پهلوی، آغاز شد، وارد میدان مبارزات سیاسی شدند و شانزده سال تمام با وجود فراز و نشیب های فراوان و شکنجه ها و تعبیدها و زندان ها مبارزه کردند و در این مسیر ازهیچ خطری نترسیدند.\n" +
                "\n" +
                "نخستین بار در محرّم سال ۱۳۸۳ از سوی امام خمینی (قدس سره) مأموریت یافتند که پیام ایشان را به آیت الله میلانی و علمای خراسان در خصوص چگونگی برنامه های تبلیغاتی روحانیون در ماه محرّم و افشاگری علیه سیاست های آمریکایی شاه و اوضاع ایران و حوادث قم، برسانند.\n" +
                "\n" +
                "ایشان این مأموریت را انجام دادند و خود نیز برای تبلیغ، عازم شهر بیرجند شدند و در راستای پیام امام خمینی، به تبلیغ و افشاگری علیه رژیم پهلوی و آمریکا پرداختند. بدین خاطر در ۹ محرّم «۱۲ خرداد ۱۳۴۲» دستگیر و یک شب بازداشت شدند و فردای آن به شرط اینکه منبر نروند و تحت نظر باشند آزاد شدند.\n" +
                "\n" +
                "با پیش آمدن حادثه خونین ۱۵خرداد، باز هم ایشان را از بیرجند به مشهد آورده، تحویل بازداشتگاه نظامی دادند و ده روز در آنجا با سخت ترین شرایط و شکنجه و آزارها زندانی شدند.\n" +
                "\n" +
                "    دوّمین بازداشت\n" +
                "\n" +
                "در بهمن ۱۳۴۲ - رمضان ۱۳۸۳- آیت الله خامنه ای با عدّه\u200Cای از دوستانشان براساس برنامه حساب شده ای به مقصد کرمان حرکت کردند. پس از دو ـ سه روز توقف در کرمان و سخنرانی و منبر و دیدار با علما و طلـّاب آن شهر، عازم زاهدان شدند.\n" +
                "\n" +
                "سخنرانی ها و افشاگری های پرشور ایشان بویژه درایـّام ششم بهمن ـ سالگرد انتخابات و رفراندوم قلـّابی شاه ـ مورد استقبال مردم قرار گرفت.\n" +
                "\n" +
                "در روزپانزدهم رمضان که مصادف با میلاد امام حسن (ع) بود، صراحت و شجاعت و شور انقلابی ایشان در افشاگری سیاستهای شیطانی و آمریکایی رژیم پهلوی، به اوج رسید و ساواک شبانه ایشان را دستگیر و با هواپیما روانه تهران کرد.\n" +
                "\n" +
                "رهبر بزرگوار، حدود دو ماه ـ به صورت انفرادی ـ در زندان قزل قلعه زندانی شدند و انواع اهانت ها و شکنجه ها را تحمّل کردند.\n" +
                "\n" +
                "    سوّمین و چهارمین بازداشت\n" +
                "\n" +
                "کلاس\u200Cهای تفسیر و حدیث و اندیشه اسلامی ایشان در مشهد و تهران با استقبال کم نظیر جوانان پرشور و انقلابی مواجه شد. همین فعالیت ها سبب عصبانیت ساواک شد و ایشان را مورد تعقیب قرار دادند.\n" +
                "\n" +
                "بدین خاطر در سال ۱۳۴۵ در تهران مخفیانه زندگی می کردند و یک سال بعد ـ ۱۳۴۶ـ دستگیر و محبوس شدند. همین فعالیّت های علمی و برگزاری جلسات و تدریس و روشنگری عالمانه و مصلحانه بود که موجب شد آن بزرگوار بار دیگر توسط ساواک جهنّمی پهلوی در سال ۱۳۴۹ نیز دستگیر و زندانی گردند. \n" +
                "\n" +
                "    پنجمین بازداشت\n" +
                "\n" +
                "حضرت آیت الله خامنه ای «مد ظله» درباره پنجمین بازداشت خویش توسط ساواک می نویسد: «از سال ۴۸ زمینه حرکت مسلحانه در ایران محسوس بود. حساسیّت و شدّت عمل دستگاههای جاری رژیم پیشین نیز نسبت به من، که به قرائن دریافته بودند چنین جریانی نمی تواند با افرادی از قبیل من در ارتباط نباشد، افزایش یافت. سال ۵۰ مجدّداً و برای پنجمین بار به زندان افتادم. برخوردهای خشونت آمیز ساواک در زندان آشکارا نشان می داد که دستگاه از پیوستن جریان های مبارزه مسلـّحانه به کانون های تفـّکر اسلامی به شدّت بیمناک است و نمی تواند بپذیرد که فعالیّـت های فکری و تبلیغاتی من در مشهد و تهران از آن جریان ها بیگانه و به کنار است. پس از آزادی، دایره درسهای عمومی تفسیر و کلاسهای مخفی ایدئولوژی و... گسترش بیشتری پیدا کرد».\n" +
                "\n" +
                "در بین سال\u200Cهای ۱۳۵۰ـ۱۳۵۳ درسهای تفسیر و ایدئولوژی آیت الله خامنه\u200Cای در سه مسجد «کرامت»، «امام حسن» و «میرزا جعفر» مشهد مقدس تشکیل می\u200Cشد و هزاران نفر ازمردم مشتاق بویژه جوانان آگاه و روشنفکر و طلـّاب انقلابی و معتقد را به این سه مرکز می کشاند و با تفکّرات اصیل اسلامی آشنا می ساخت.\n" +
                "\n" +
                "درس نهج البلاغـه ایشان از شور و حال دیگـری برخوردار بود و در جزوه\u200Cهای پلی کپی شده تحت عنوان: «پرتوی از نهج البلاغه» تکثیر و دست به دست می\u200Cگشت.\n" +
                "\n" +
                "طلـّاب جوان و انقلابی که درس حقیقت و مبارزه را از محضر ایشان می\u200Cآموختند، با عزیمت به شهرهای دور و نزدیکِ ایران، افکار مردم را با آن حقایق نورانی آشنا و زمینه را برای انقلاب بزرگ اسلامی آماده می ساختند. این فعالیـّت ها موجب شد که در دی ماه ۱۳۵۳ ساواک بی رحمانه به خانه آیت الله خامنه ای در مشهد هجوم برده، ایشان را دستگیر و بسیاری از یادداشت ها و نوشته هایشان را ضبط کنند.\n" +
                "\n" +
                "این ششمین و سخت ترین بازداشت ایشان بود و تا پاییز ۱۳۵۴ در زندان کمیته مشترک شهربانی زندان بودند. در این مدت در سلولی با سخت ترین شرایط نگه داشته شدند. سختی هایی که ایشان در این بازداشت تحمّل کردند، به تعبیر خودشان «فقط برای آنان که آن شرایط را دیده اند، قابل فهم است».\n" +
                "\n" +
                "پس از آزادی از زندان، به مشهد مقدس برگشتند و باز هم همان برنامه و تلاش های علمی و تحقیقی و انقلابی ادامه داشت. البته دیگر امکان تشکیل کلاسهای سابق را به ایشان ندادند.\n" +
                "\n" +
                "    در تبعید\n" +
                "\n" +
                "رژیم جنایتکار پهلوی در اواخر سال ۱۳۵۶، آیت الله خامنه ای را دستگیر و برای مدّت سه سال به ایرانشهر تبعید کرد. در اواسط سال ۱۳۵۷ با اوجگیری مبارزات عموم مردم مسلمان و انقلابی ایران، ایشان از تبعیدگاه آزاد شده به مشهد مقدس بازگشتند و در صفوف مقدم مبارزات مردمی علیه رژیم سفـّاک پهلوی قرار گرفتند و پس از پانزده سال مبارزه مردانه و مجاهدت و مقاومت در راه خدا و تحمّل آن همه سختی و تلخی، ثمره شیرین قیام و مقاومت و مبارزه؛ یعنی پیروزی انقلاب کبیر اسلامی ایران و سقوط خفـّت بار حکومتِ سراسر ننگ و ظالمانه پهلوی، و برقراری حاکمیت اسلام در این سرزمین را دیدند.\n" +
                "\n" +
                "    در آستانه پیروزی\n" +
                "\n" +
                "درآستانه پیروزی انقلاب اسلامی، پیش از بازگشت امام خمینی از پاریس به تهران، «شورای انقلاب اسلامی» با شرکت افراد و شخصیت\u200Cهای مبارزی همچون شهید مطهری، شهید بهشتی، هاشمی رفسنجانی و... از سوی امام خمینی در ایران تشکیل گردید، آیت الله خامنه ای نیز به فرمان امام بزرگوار به عضویت این شورا درآمد.\n" +
                "\n" +
                "پیام امام توسط شهید مطهری «ره» به ایشان ابلاغ گردید و با دریافت پیام رهبر کبیر انقلاب، از مشهد به تهران آمدند.\n" +
                "\n" +
                "    پس از پیروزی\n" +
                "\n" +
                "آیت الله خامنه ای پس از پیروزی انقلاب اسلامی نیز همچنان پرشور و پرتلاش به فعالیّت های ارزشمند اسلامی و در جهت نزدیکتر شدن به اهداف انقلاب اسلامی پرداختند که همه در نوع خود و در زمان خود بی نظیر و بسیار مهّم بودند که در این مختصر فقط به ذکر رؤوس آنها می پردازیم:\n" +
                "\n" +
                "٭ پایه گذاری «حزب جمهوری اسلامی» با همکاری و همفکری علمای مبارز و هم رزم خود: شهید بهشتی، شهید باهنر، هاشمی رفسنجانی و... دراسفند ۱۳۵۷.\n" +
                "٭ معاونت وزارت دفاع در سال ۱۳۵۸.\n" +
                "٭ سرپرستی سپاه پاسداران انقلاب اسلامی، ۱۳۵۸.\n" +
                "٭ امام جمعه تهران، ۱۳۵۸.\n" +
                "٭ نماینده امام خمینی«قدّس سرّه» در شورای عالی دفاع ، ۱۳۵۹.\n" +
                "٭ نماینده مردم تهران در مجلس شورای اسلامی، ۱۳۵۸.\n" +
                "٭ حضور فعّال و مخلصانه در لباس رزم در جبهه های دفاع مقدس، در سال ۱۳۵۹ با شروع جنگ تحمیلی عراق علیه ایران و تجاوز ارتش متجاوز صّدام به مرزهای ایران؛ با تجهیزات و تحریکات قدرت های شیطانی و بزرگ ازجمله آمریکا و شوروی سابق.\n" +
                "٭ ترور نافرجام ایشان توسط منافقین در ششم تیرماه ۱۳۶۰ در مسجد ابوذر تهران.\n" +
                "٭ ریاست جمهوری؛ به دنبال شهادت محمد علی رجایی دومّین رئیس جمهور ایران، آیت الله خامنه ای در مهر ماه ۱۳۶۰ با کسب بیش از شانزده میلیون رأی مردمی و حکم تنفیذ امام خمینی (قدس سره) به مقام ریاست جمهوری ایران اسلامی برگزیده شدند. همچنین از سال ۱۳۶۴ تا ۱۳۶۸ برای دوّمین بار به این مقام و مسؤولیت انتخاب شدند.\n" +
                "٭ ریاست شورای انقلاب فرهنگ، ۱۳۶۰.\n" +
                "٭ ریاست مجمع تشخیص مصلحت نظام، ۱۳۶۶.\n" +
                "٭ ریاست شورای بازنگری قانون اساسی، ۱۳۶۸.\n" +
                "٭ رهبری و ولایت امّت، که از سال ۱۳۶۸، روز چهاردهم خرداد پس از رحلت رهبر کبیرانقلاب امام خمینی (قدس سره) توسط مجلس خبرگان رهبری به این مقام والا و مسؤولیت عظیم انتخاب شدند، و چه انتخاب مبارک و درستی بود که پس از رحلت امام راحل، با شایستگی تمام توانستند امّت مسلمان ایران، بلکه مسلمانان جهان را رهبری نمایند." +
                "");
    }


    @TargetApi(Build.VERSION_CODES.JELLY_BEAN_MR1)
    private void forceRTLIfSupported(){
        if(Build.VERSION.SDK_INT >= Build.VERSION_CODES.JELLY_BEAN_MR1){
            getWindow().getDecorView().setLayoutDirection(View.LAYOUT_DIRECTION_RTL);
        }
    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        switch (item.getItemId()) {
            case android.R.id.home:
                //Write your logic here
                this.finish();
                return true;
            default:
                return super.onOptionsItemSelected(item);
        }
    }

    @Override
    protected void attachBaseContext(Context newBase) {
        super.attachBaseContext(CalligraphyContextWrapper.wrap(newBase));
    }
}
